{
 "  Principles of Synthetic Biology ": "This introductory synthetic biology course starts with a brief overview of the field and then delves into more challenging yet exciting concepts. You will learn ...",
 "  Design and Development of Educational Technology ": "To be effective, educational technologies must be designed based on what we know about how people learn. Through interviews with experts in the field, this cours...",
 "  Research Methods ": "Introduction to the research methodologies frequently used in the social sciences.",
 "  Art and Inquiry: Museum Teaching Strategies For Your Classroom ": "Explore how to integrate works of art into your classroom with inquiry-based teaching methods originally developed for in-gall...",
 "  American Capitalism: A History ": "Examine how economic development fueled the United States’ evolution from 13 backwater colonies to a global power.",
 "  Global Tuberculosis (TB) Clinical Management and Research ": "Health Care Workers and Health Professions Students can prepare to plan and deliver TB care in their communities by applying the latest clinical and research dat...",
 "  An Introduction to Consumer Neuroscience & Neuromarketing ": "This course will introduce you to the multidisciplinary field of consumer neuroscience and neuromarketing. It will go through to the basic concepts of the human ...",
 "  Introduction to Molecular and Cellular Biology Lab ": "Introductory course that uses various activities and exercises to provide the basic principles and methods of biology. Lab topics include: the scientific method,...",
 "  Ancient Civilizations of the World ": "Introductory survey to the major civilizations of the ancient world from the Paleolithic Era to the Middle Ages, with special emphasis on the nature and characte...",
 "  Sustainability in Practice ": "Sustainability is a practice operating across a variety of scales and skills. We will explore the ways that decision makers us...",
 "  Media LIT: Overcoming Information Overload ": "Media literacy helps us understand, analyze and create media. While we rely on good journalism to provide accurate information...",
 "  Exoplanets ": "The discovery of exoplanets is one of the greatest revolutions in modern astrophysics. Twenty years ago, we had no idea whether any of the countless stars out th...",
 "  Cities are back in town : urban sociology for a globalizing urban world ": "Urbanization is reaching a new peak in the contemporary world with the rise of mega cities. Researchers try to make sense of t...",
 "Digital Marketing: Challenges and Insights ": "Explore the latest trends in digital marketing. Get beneath the hype. What are the implications? How will you respond?",
 "  Digital Spring School \"Brain, Lifestyle and Learning\" ": "This digital Spring School focuses on three lifestyle factors in relation to brain, learning, and cognition. The lifestyle factors physical activity, nutrition a...",
 "  Dog Behavior: Problems and Solutions ": "Oddly enough, the contribution of behavioral science to helping people deal with dog behavioral problems and train dogs has only been modest. In this course, we ...",
 "  Songwriting ": "Learn an efficient, effective process for writing songs that express your ideas and emotions, including a range of tools that ...",
 "  Chemicals and Health ": "This course covers chemicals in our environment and in our bodies and how they impact our health. It addresses policies and pr...",
 "  Accountable Talk®: Conversation that Works ": "Designed for teachers and learners in every setting - in school and out, in formal learning environments or at home - this course is an introduction to the theor...",
 "  The Einstein Revolution ": "Albert Einstein has become the icon of modern science. Following his scientific, cultural, philosophical, and political trajectory, this course aims to track the...",
 "  Models in Architecture – design through physical & digital models ": "Physical and digital design skills are key to practitioners in art, design, and engineering, as well as many other creative professions. Models are essential in ...",
 "  Music's Big Bang: The Genesis of Rock 'n' Roll ": "Explores the factors — musical and cultural — that led to the birth of American rock 'n' roll music in the early 1950s.",
 "  Understanding Media by Understanding Google ": "Few people who \"just Google it\" to find an answer to their every question understand just what the company does (and why). Through this course, you'll join the m...",
 "  Sustainability in Everyday Life ": "Daily headlines warn of new chemical dangers, species on the edge of extinction, global warming-- framing our planet as “at ri...",
 "  Inequalities in Personal Finance: the Baby Boom Legacy ": "Explore the concerns about rising generational and economic inequalities in developed countries, with this free online course....",
 "  Cyberwar, Surveillance and Security ": "Once heralded as the ultimate vehicle for open communication and self-expression, the internet is rapidly becoming a globally ...",
 "  Age of Jefferson ": "This is a six week course providing an overview of Thomas Jefferson's work and perspectives presented by the University of Vir...",
 "  Statistics II ": "Review of basic statistics and an application of statistical tools and techniques that are routinely used by modern statisticians for building models to analyze ...",
 "  The Addicted Brain ": "This is a course about addiction to drugs and other behaviors. It will describe what happens in the brain and how this informa...",
 "  Animal Behaviour and Welfare ": "Animal welfare has been described as a complex, multi-faceted public policy issue which includes important scientific, ethical, and other dimensions. Improving o...",
 "  Communication in the 21st Century Workplace ": "Communication, both verbal and nonverbal, is at the foundation of everything we do and say, and is especially important in the 21st century workplace. The focus ...",
 "  Gas Dynamics ": "Concept of Waves in fluid, Mach waves, Compression waves, Expansion waves, Isentropic flow, Shock waves, Stationary and Moving Shocks, Oblique Shocks, Bow Shocks...",
 "  Liver Disease: Looking after Your Liver ": "Learn about how your liver works, ways to look after it and how liver damage is caused, studied and treated around the world.",
 "  Dino 101: Dinosaur Paleobiology ": "Dino 101: Dinosaur Paleobiology is a 12-lesson course teaching a comprehensive overview of non-avian dinosaurs. Topics covered...",
 "  The Ethics of Eating ": "We all face difficult moral decisions on occasion.  This course introduces students to the idea that we face such a decision s...",
 "  From the Big Bang to Dark Energy ": "This course will cover various topics on the discoveries about how the Universe evolved in 13.7 billion years since the Big Bang.",
 "  The Brain and Space ": "This course is about how detective work by the brain creates our sense of spatial location from a variety of sensory and motor...",
 "  Chinese Thought: Ancient Wisdom Meets Modern Science ": "This course is designed to give students a thorough introduction to Warring States (5th-3rd century BCE) Chinese thought, focu...",
 "  Fundamentals of Electrical Engineering Laboratory ": "This hands-on laboratory course complements Coursera's Fundamentals of Electrical Engineering. The course develops basic skills in constructing and measuring ele...",
 "Good Brain, Bad Brain: Basics ": "What do we know and what are we discovering about the form and function of the human brain? Find out with this free online cou...",
 "  Digital Systems ": "In this course we will learn how to design digital circuits, following an up to date and practical orientation. Although we will study the basic electronic devic...",
 "  Starting a business: realise your vision ": "Explore the complexities of starting a business; an interactive course led by inspirational academics, entrepreneurs and advisers.",
 "  How to be a Peer Facilitator ": "This is a generic course for Transition to First Year Undergraduate Bachelor",
 "  Global Blindness: Planning and Managing Eye Care Services ": "Understand global blindness and how to plan effective eye care with this free online course for health professionals",
 "  Journalism for Social Change ": "In a vibrant democracy, journalism and media have the power and responsibility to both inform and inspire the public to politi...",
 "  AP Spanish Language and Culture ": "AP® Spanish Language and Culture is a challenging course taught exclusively in Spanish that helps students to improve their pr...",
 "  Street-Fighting Math ": "Teaches, as the antidote to rigor mortis, the art of educated guessing and opportunistic problem solving.",
 "  Jet Aircraft Propulsion ": "Introduction to Aircraft Jet Propulsion. Jet Engine Cycles: Thermodynamic Analysis of real cycles. Compressors and Turbines. Combustion Systems.Intakes and Prope...",
 "  Resilience in Children Exposed to Trauma, Disaster and War: Global Perspectives ": "How do children overcome hazardous experiences to succeed in life? What can be done to protect young people at risk from traum...",
 "  Teaching and Assessing Clinical Skills ": "The purpose of this course is to improve feedback, clinical teaching, and assessment of clinical skills.",
 "  Political Philosophy: An Introduction ": "Are you interested in politics? Do you feel the need to have a clearer understanding of it, beyond the conventional language of media and social networks? Well, ...",
 "  Religion and Hip Hop Culture ": "What is religion? What is Hip-Hop? Are they the same thing? Do they overlap? Over six weeks we’ll get a sense of how some indi...",
 "Auf Deutsch: Communicating in German Across Cultures ": "By the end of this course you will have developed a spoken and written profile in German that reflects your backgrounds, custo...",
 "  Financial Evaluation and Strategy: Corporate Finance ": "Learn how to use key finance principles to understand and measure business success and to identify and promote true value crea...",
 "  Statistical Thermodynamics: Molecules to Machines ": "Thermodynamics explains phenomena we observe in the natural world and is the cornerstone of all of engineering. You're going to learn about thermodynamics from a...",
 "  Intro to Hadoop and MapReduce ": "In this short course, learn the fundamentals of MapReduce and Apache Hadoop to start making sense of Big Data in the real worl...",
 "  Introduction to United States History ": "Examination of the major political, economic, and social changes that took place in America from the end of the Civil War in 1...",
 "  Introduction to ecosystems ": "Ecosystems is about the relationships between living organisms. Gain an understanding of the natural world, how the web of lif...",
 "  Principles of Electric Circuits: Part 1 ": "In Principles of Electric Circuits, you will learn sufficient techniques for analyzing and designing circuits.",
 "  Statistical Mechanics: Algorithms and Computations ": "In this course you will learn a whole lot of modern physics (classical and quantum) from basic computer programs that you will download, generalize, or write fro...",
 "  Introduction to Psychology ": "In this day and age, as the physical quality of life  improves, it is particularly important to focus on psychology. In Universities in the United States, psycho...",
 "  Introduction to Guitar ": "Grasp the essentials needed to begin playing acoustic or electric guitar. You'll learn an easy approach to get you playing quickly, through a combination of expl...",
 "  An Introduction to Interactive Programming in Python ": "This course is designed to be a fun introduction to the basics of programming in Python. Our main focus will be on building si...",
 "  Designing, Running, and Analyzing Experiments ": "You will never know whether you have an effective user experience until you have tested it with users. In this course, you'll ...",
 "  Creative Problem Solving ": "This course deals directly with your ability for creativity which is a critical skill in any field. It focuses on divergent th...",
 "  Pre-Calculus ": "This course covers mathematical topics in algebra and trigonometry and is designed to prepare students to enroll for a first semester course in single variable ...",
 "  Diploma in Psychology ": "ALISON's free online Diploma in Psychology is an engaging course, and is packed with features to help you understand and evaluate classic and contemporary psycho...",
 "  Introduction to Financial Accounting ": "Introductory survey of financial accounting in preparation for more advanced business courses. Topics include the compilation and analysis of financial statement...",
 "  How to Build a Startup ": "Learn the key tools and steps to build a successful startup (or at least reduce the risk of failure). An introduction to the b...",
 "  Understanding Research Methods ": "Our course enables students to develop their understanding of research methods, and confidence in designing a research project...",
 "  Pathobiology ": "Detailed study of the subject of human disease, placing special emphasis on the cause of disease at the tissue level. Focuses on what happens at the molecular an...",
 "  The Modern World: Global History since 1760 ": "This is a survey of modern world history, from a global perspective, beginning with the economic and political revolutions of ...",
 "  Introduction to Computational Arts ": "This multidisciplinary production class serves as an introduction to, and exploration of electronic media in the arts. Lecture...",
 "  9 11 and Its Aftermath Part1 ": "This course will explore the forces that led to the 9/11 attacks and the policies the United Statses adopted in response. We will examine the phenomenon of moder...",
 "  Design and Interpretation of Clinical Trials ": "Learn the basic principles for design of randomized clinical trials and how they should be reported.",
 "  Origins - Formation of the Universe, Solar System, Earth and Life ": "The Origins course tracks the origin of all things – from the Big Bang to the origin of the Solar System and the Earth. The co...",
 "  Social Epidemiology ": "Social epidemiology is about how a society makes people sick and/or healthy. We address not only the identification of new disease risk factors (e.g., deficient ...",
 "  Launching New Ventures ": "Develop your promising idea into a successful business concept proposal, and launch it! Gain practical experience in the key steps of the venture creation proces...",
 "  AP® Psychology - Course 4: How Behavior Works ": "This psychology course is all about how behavior works. You will learn the theories of motivation, hunger, eating, the obesity...",
 "  Electroceramics ": "This course is an advanced level course for UG students and early PG students of Materials Science and Metallurgy. Various aspects of electronic ceramics are cov...",
 "  Fundamentals of Economics ": "This course is an introduction to Economics, fundamentals of micro- and macroeconomics. The main issues are: economic principles, demand and supply, markets, com...",
 "  Computer-Aided Design (CAD) ": "Exploration of the professional modeling tool known as Computer Aided Design (CAD). Covers engineering graphics, isometric, ot...",
 "  Scientific Humanities ": "« Scientific humanities » means the extension of interpretative skills to the discoveries made by science and to technical innovations. The course will equip fut...",
 "  Genomic and Precision Medicine ": "A critical, unbiased introduction to using new genomic tools for diagnosing and managing disease.",
 "  First Year Teaching (Elementary Grades) - Success from the Start ": "Success with your students starts on Day 1. Learn from NTC's 25 years developing key skills and strategies to create positive, productive classroom environments ...",
 "  Mechanics ReView ": "Mechanics ReView is an MIT-level introductory mechanics class emphasizing a strategic problem-solving approach.  It covers the same syllabus topics as the Advanc...",
 "  Exploring Play: The Importance of Play in Everyday Life ": "Understanding the nature and value of play through the course of our lives, across cultures and communities.",
 "  The Global Student's Introduction to U.S. Law ": "This course will provide students from around the world an introduction to the legal system of the United States.",
 "  Art of the Islamic World ": "Introductory survey of the pre-modern Islamic artistic and architectural traditions of the Islamic dynasties in the Mediterran...",
 "  Introduction to Cloud Computing ": "Cloud computing is one of the hottest technical topics today, with broad-ranging effects across IT, Information Architecture, ...",
 "  Materials and Energy balance in Metallurgical Processes ": "Introduction, Relationship between energy balance, energy conservation and environment; Dimensions, units and conversion factors; Stoichiometry; Principles of ca...",
 "  Entendiendo el Impacto Social: la forma en que Acumen mide y analiza el impacto social ": "Este curso introductorio de cinco módulos le enseńará cómo analiza Acumen el impacto social de sus empresas de cartera y que u...",
 "  The New Nordic Diet - from Gastrnomy to Health ": "The New Nordic Diet is a new food culture which emphasizes gAstrnomy, health, and environment. This course presents the scient...",
 "  Unpredictable? Randomness, Chance and Free Will ": "This cross-disciplinary course deals with the undetermined, the unpredictable- or what appears to be such. Learn about the usefulness of randomness in communicat...",
 "  AP® Biology - Part 4: Ecology ": "The fourth course in a comprehensive series designed to prepare you for the AP Biology exam, focusing on ecology. ",
 "  Tales from the Genome ": "Learn the basics of genetics, with a personal twist. This class is all about DNA and how it shapes who we are.",
 "  The Horse Course: Introduction to Basic Care and Management ": "There are over 100 million horses, donkeys and mules in the world today and owners of these animals can be found on almost every continent and in almost every so...",
 "  Discrete Time Signals and Systems ": "Enter the world of signal processing: analyze and extract meaning from the signals around us!",
 "  Practical Ethics ": "Is abortion wrong? Should we eat animals? What is our responsibility to the world’s poor? This course will encourage you to ex...",
 "  Advanced Control System Design for Aerospace Vehicles ": "In this course concepts and techniques of linear and nonlinear control system analysis and synthesis will be studied in the modern control (state space) framewo...",
 "Theory of Yarn Structures ": "Compression of fibrous assemblies, Pores among fibres, Orientation of fibres, Mechanics of parallel fibre bundles, Modelling of intern al yarn geometry, Relation...",
 "  Principles and Practice of Computer Aided Translation ": "This course teaches the basic concepts of computer-aided translation technology, helps students learn to use computer-assisted translation tools.",
 "  The American South: Its Stories, Music, and Art ": "From small farms to urban neighborhoods, from the region itself to the more distant worlds of the southern diaspora, we discover the stories, music, and art of t...",
 "Design 101 (or Design Basics) ": "Design your own world. Are you ready? This MOOC is a journey into contemporary design through 101 exercises. Learn by doing and transform your everyday life into...",
 "  Preparing for the AP* Computer Science A Exam — Part 2 ": "CSAP.1x covers the material of AP Computer Science A which is equivalent to a first-semester, college-level course in computer...",
 "  Performance Assessment in the Virtual Classroom ": "Performance and Assessment in the Virtual Classroom explores the myths and challenges of assessing performance virtually. Topics include effective measures of as...",
 "  Medical Genomics 101 ": "If you are seeking CME credit, you must register with Charlotte Area Healthcare Education Center: CLICK HERE to register for CME This medical course includes six...",
 "  Health Policy and the Affordable Care Act ": "This course will explore the many problems of the American health care system and discuss the specific ways that the Affordabl...",
 "  The Power of Macroeconomics: Economic Principles in the Real World ": "In this course, you will learn all of the major principles of macroeconomics normally taught in a quarter or semester course to college undergraduates or MBA stu...",
 "  Principles of Macroeconomics ": "All of us are affected by macroeconomic forces – they shape the very world we live in. And governments all around the world try to shape those forces in ways tha...",
 "  Smart Cities ": "Cities are first and foremost built for people, and in today’s world, people produce large amounts of valuable data, thus cont...",
 "  Fundamentals of Pharmacology ": "In this class you will learn how drugs affect the body, how they alter disease processes and how they might produce toxicity. ...",
 "  Understanding and Improving the US Healthcare System ": "In this course, you will learn about the structure, accomplishments, and shortcomings of the US healthcare system, and how those have prompted attempts at reform...",
 "  Understanding Research: An Overview for Health Professionals ": "Participants will learn the elements of research methods and design that are essential to the translation of knowledge into clinical practice, administration/lea...",
 "  Advanced Chemistry ": "This course is designed to look at the topics covered in advanced high school chemistry courses, correlating to the standard topics as established by the America...",
 "  Descubriendo la pintura europea de 1400 a 1800 ": "El significado del arte de Caravaggio, Rembrandt, Goya y muchos más.",
 "  Principles of Economics with Calculus ": "Quantitative and model-based introduction to basic ideas in economics, and applications to a wide range of real world problems.",
 "  Project Management: The Basics for Success ": "This course combines the essential elements of Project Management and Team Leadership into one course. Through class engagement and reflection, you will acquire ...",
 "  Data Structures • 数据结构 ": "Learn the basics of data structures and methods to design algorithms and analyze their performance.",
 "  Physical Chemistry II ": "Exploration of quantum mechanics, with particular emphasis on wave-like particle behavior, the Schrödinger Equation, particle-in-a-box, Eigenstates and Eigenvalu...",
 "  Preparing for the AP* Computer Science A Exam — Part 1 ": "CSAP.1x  covers the material of AP Computer Science A which is equivalent to a first-semester, college-level course in compute...",
 "  African Art ": "Exploration of the objects, images, and sites representing the diverse ethnic and artistic heritage of Africa, with particular...",
 "  History of Rock, Part Two ": "Learn about the growth of rock music, from the early 1970s through the rise of punk and disco in the late 1970s, and from the emergence of MTV, hip hop, and heav...",
 "  Introduction to User Interface Design (Part 2) ": "In this course the student will learn about the third and fourth cycles of user interface design: prototyping and user evaluat...",
 "  An Introduction to Operations Management ": "This course will teach you how to analyze and improve business processes, be it in services or in manufacturing. You will learn how to improve productivity, how ...",
 "  Civil War and Reconstruction - Part 1 1850 -1861 ": "Discover how the issue of slavery came to dominate American politics, and how political leaders struggled and failed to resolv...",
 "  Dog Origins ": "The origin of dogs is shrouded in mystery. In this course, you will learn how to interpret the often contradictory ideas about how, why, where and when dogs aros...",
 "  Circuits and Electronics ": "Teaches the fundamentals of circuit and electronic analysis.",
 "  Surveillance Law ": "Learn how police and intelligence agencies can access your data, and how the law (might) protect you! Hackers, attorneys, and ...",
 "  Rationing and Allocating Scarce Medical Resources ": "This course will explore the complex challenges of allocating scare medical resources at both the micro and macro level. Students will learn the theories behind ...",
 "  Designing a New Learning Environment ": "What constitutes learning in the 21st century? Should reading, watching, memorizing facts, and then taking exams be the only way to learn? Or could technology (u...",
 "AP® Spanish Language and Culture ": "Do you want to take the AP Spanish exam, but your school doesn’t offer a Spanish language course? Are you looking for a way to...",
 "  Pre-University Calculus ": "Pre-university Calculus will prepare you for Introductory Calculus courses. In this course you will refresh, or become familiar with, some elementary mathematics...",
 "  CS For All: Introduction to Computer Science and Python Programming ": "This computer science  course provides an introduction to computer science that’s both challenging and fun. It takes a broad look at the field of computer scienc...",
 "  Introduction to Operations Management ": "Understand key aspects of business operations and lean management including capacity, productivity, quality, and supply chain.",
 "  Why We Need Psychology ": "For adults with an interest in the study of human behaviour – especially those who have often considered studying psychology but who have yet to begin.",
 "  Immunology ": "Examination of the immune system, including innate and adaptive immunity, the cells involved in each of process of the immune ...",
 "  Cell Biology: Mitochondria ": "The cell is a powerful case study to help us explore the functional logic of living systems. All organisms, from single-celled algae to complex multicellular org...",
 "  Turn Down the Heat: Why a 4°C Warmer World Must be Avoided ": "It is now clear that without action on climate change, the world may become 4°C warmer by the end of this century. Such an inc...",
 "  Making Sense of Climate Science Denial ": "In public discussions, climate change is a highly controversial topic. However, in the scientific community, there is little c...",
 "  Fundamentals of Neuroscience, Part I ": "Discover what makes your brain tick in this first module of a three-part introductory series in neuroscience.",
 "  America's Written Constitution ": "This course is designed to introduce you to one of the most important texts in human history—the United States Constitution. ...",
 "  Measuring and Valuing Health ": "Learn how Patient Reported Outcome Measures and Quality Adjusted Life Years can compare treatments and inform healthcare spend...",
 "  Experimental Gas Aerodynamics ": "The course covers experimental aspects in the study of Aero/Gas Dynamics. It covers lectures on aero/gas dynamic facilities for experimentation in the various sp...",
 "  Global Warming: The Science of Climate Change ": "This class describes the science of global warming and the forecast for humans' impact on Earth's climate. Intended for an aud...",
 "  Society, Economy, and the Environment ": "The course will begin with a primer of complex systems theory and then will discuss the theory’s influence on the science of societal collapse. Then, the course...",
 "  Financial Analysis of Entrepreneurial Ideas ": "In this course we will introduce you to some of the accounting and financial management techniques that any entrepreneur insid...",
 "  Healthcare Technologies to Assess Human Behavior for Health Management ": "Introduction to Behavioral Imaging, a new research field which encompasses the measurement, modeling, analysis, and visualization of behaviors from multi-modal s...",
 "  Relativity and Astrophysics ": "Explore the powerful and intriguing connections between astronomy and Einstein’s theory of relativity.",
 "  Applied Logistic Regression ": "This course provides theoretical and practical training on the increasingly popular logisticregression model, which has become the standard analytical method for...",
 "  Advertising and Society ": "This course examines the relation of advertising to society, culture, history, and the economy. Using contemporary theories about visual communications, we lear...",
 "  The Practitioner’s Guide to Global Health ": "Whether you’re considering a global health learning experience such as a clinical rotation, a research project, or volunteer work, or are preparing to work abroa...",
 "  Preparing for the AP* Calculus AB Exam ": "This six week course will help students prepare for the AP* Calculus AB Exam.* AP Calculus is a registered trademark of the Co...",
 "  User Experience for the Web ": "Learn to create great experiences for people visiting websites, with proven tools and techniques.",
 "  Arts of Asia ": "Introductory survey on the major pre-modern artistic traditions in Asia, focusing on the art and architecture of India, China,...",
 "  Tropical Parasitology: Protozoans, Worms, Vectors and Human Diseases ": "This course provides students an understanding of important human parasitic diseases, including their life cycles, vectors of transmission, distribution and epid...",
 "  Diploma in Legal Studies ": "This free online Diploma in Legal Studies course from ALISON.com gives you the opportunity to study key subjects in legal studies, greatly increasing your unders...",
 "Introduction to forensic science ": "The methods and scientific underpinning of forensic science, from crime scene investigation to reporting evidential value with...",
 "  Linear Circuits ": "Learn the analysis of circuits including resistors, capacitors, and inductors. This course is directed towards people who are in science or engineering fields o...",
 "  Digital Branding and Engagement ": "Learn how to increase brand engagement through the creation and distribution of content using an owned digital channel approach. Digital technology has rapidl...",
 "  Delft Design Approach ": "Introduction to fundamentals and methods of the Delft approach to designing meaningful products and services.",
 "  Process Improvement ": "Gain practical skills for analyzing and improving work processes and for organizing initiatives for continuous improvement of ...",
 "  Programming Foundations with Python ": "Introductory programming class to learn Object-Oriented Programming, a must-have technique to reuse and share code easily. Lea...",
 "  Algorithms, Biology, and Programming for Beginners ": "This course will cover algorithms for solving various biological problems along with a handful of programming challenges testi...",
 "  How Green Is That Product? An Introduction to Environmental Life Cycle Assessment ": "In this course you will learn the basics of the life-cycle assessment (LCA) method for holistic environmental analysis of products, technologies, and systems. LC...",
 "  Blended Learning: Personalizing Education for Students ": "Blended learning is a new educational model with great potential to increase student outcomes and create exciting new roles for teachers. In this course you wil...",
 "  How Stuff Moves ": "WHAT IS “HOW STUFF MOVES”? Mechanics is the study of how things move. It was the first quantitative science to achieve wide power to predict behavior, including ...",
 "  Financial Engineering and Risk Management Part II ": "This course follows on from FE & RM Part I. We will consider portfolio optimization, risk management and some advanced example...",
 "  Waves & Optics ": "PHYS201x follows introductory physics courses with a more detailed treatment of oscillators, waves on strings, and electromagnetic waves. In addition to deriving...",
 "  The Road to Selective College Admissions ": "The Road to Selective College Admissions is designed for students in 10th and 11th grade who are looking to navigate the colle...",
 "  The DO School Start-Up Lab ": "Taking your great ideas and making them a reality is never easy. The Start-Up Lab helps you stop dreaming and start DOing, int...",
 "  The Art of Negotiation ": "Participants explore how current approaches to negotiation strategy and tactics are used, what negotiation entails, types of negotiation relationships that exist...",
 "  TechniCity ": "We live in real-time, technologically enhanced cities. Explore the sweeping changes that our cities are undergoing as a re...",
 "  iMOOC101: Mastering American eLearning ": "This competency-based, skill-building course will help non-U.S. students, first generation immigrants and foreign-born profess...",
 "  The Dynamic Earth: A Course for Educators ": "How and why is the Earth constantly changing? How do scientists reconstruct events in Earth's geologic history? This course explores the origin and evolution of ...",
 "  Supply Chain Design ": "Supply Chains, especially global supply chains, are complex structures that involve several firms crossing multiple time zones and continents. The design of a su...",
 "  Contraception: Choices, Culture and Consequences ": "Learn about the wide range of contraceptive methods, and the public health implications related to access to information and choices about reproductive health.",
 "  Clinical Problem Solving ": "Participants will learn how to move efficiently from patient signs and symptoms to a rational and prioritized set of diagnostic possibilities and will learn how ...",
 "  Preparing for the AP* Physics C: Electricity and Magnetism Exam ": "This course will address introductory electricity and magnetism topics (using calculus) from a standpoint of continually askin...",
 "  Critical Issues in Urban Education ": "Urban school reform in the United States is characterized by contentious, politicized debate. This course explores a set of cr...",
 "  Epidemiology: The Basic Science of Public Health ": "This course explores public health—both locally and globally—through the lens of epidemiology. Often called “the cornerstone” of public health, epidemiology is t...",
 "  A Hands-on Introduction to Engineering Simulations ": "In this hands-on course, you’ll learn how to perform engineering simulations using a powerful tool from ANSYS, Inc. This is a problem-based course where you’ll l...",
 "  Urban Design for the Public Good: Dutch Urbanism ": "Are you an urban planner, designer, policy maker or involved or interested in the creation of good living environments? This c...",
 "  Wall Street MOOC ": "This MOOC will help you develop a better understanding of how markets work, how stocks and bonds are valued and the roles of financial instruments like options a...",
 "  Art Appreciation and Techniques ": "Introductory course that examines artistic materials and techniques, the basic principles of visual language, the history of architecture and its relationship to...",
 "  Environmental Ethics, Justice, and World Views ": "This course will introduce the concept of environmental ethics, a philosophy that extends the ethical concepts traditionally a...",
 "  The Civil War and Reconstruction - 1865-1890 ": "The Unfinished Revolution: Reconstruction and After, 1865-1890, examines the pivotal but misunderstood era of Reconstruction t...",
 "  ICT in Primary Education ": "Why and how are teachers integrating ICT (Information and Communication Technology) into primary education? In this course we analyse examples from schools in di...",
 "  Measuring Causal Effects in the Social Sciences ": "How can we know if the differences in wages between men and women are caused by discrimination or differences in background characteristics? In this course we lo...",
 "  Building an Information Risk Management Toolkit ": "In this course, you will explore several structured, risk management approaches that guide information security decision-makin...",
 "  EDIVET: Do you have what it takes to be a veterinarian? ": "This course is for anyone interested in learning more about Veterinary Medicine, giving a “taster” of courses covered in the first year of a veterinary degree an...",
 "  Lead Like an Entrepreneur ": "This is an action-oriented course to help develop your entrepreneurial leadership skills, whether or not you intend to start a new business. It will help you ree...",
 "  Introduction to Genomic Technologies ": "The basic biology of modern genomics and the experimental tools used for measurement. This is the first course in the Genomic ...",
 "  Nutrition for Health Promotion and Disease Prevention ": "This course covers the basics of normal nutrition for optimal health outcomes and evidence-based diets for a variety of diseas...",
 "  Single-Variable Calculus II ": "An application of the study of limits, derivatives, and basic integrals, to provide an understanding of functions and how they behave.",
 "  Pragmatic Randomized Controlled Trials in Health Care ": "Pragmatic randomized controlled trials reliably work out which of several healthcare interventions works best under real-world...",
 "  Municipal Solid Waste Management ": "It focuses the efficient management of solid wastes, it also deals with the treatment and management of hazardous (biomedical) wastes.",
 "  Introduction to Computer Science II ": "Detailed survey of computers, computing, and programming, with a detailed emphasis on understanding of Object-Oriented Programming and exploration of different p...",
 "  Design Thinking Action Lab ": "In this experiential course, Stanford d.school lecturer and Epicenter Deputy Director Leticia Britos Cavagnaro and her team will take you on a journey to learn t...",
 "  An Introduction to Interactive Programming in Python (Part 2) ": "This two-part course is designed to be a fun introduction to the basics of programming in Python. Our main focus will be on bu...",
 "  Marketing in a Digital World ": "This course will examine how digital tools, such as the Internet, smartphones, and 3D printing, are revolutionizing the world of marketing by shifting the balanc...",
 "  Global Adolescent Health ": "This course will explore the dynamic factors affecting the health and wellbeing of young people around the world, and how important it is for individuals, commun...",
 "  Decision Skills: Power Tools to Build Your Life ": "This course demonstrates how a framework to help us make better decisions, decision quality, can help overcome common mistakes humans fall into, decision traps.",
 "  Cyber-Physical Systems ": "EECS149.1x introduces students to the design and analysis of computational systems that are integrated with physical processes.",
 "  Contar Historias para el Cambio ": "Este curso práctico le ayudará a desarrollar sus habilidades para narrar historias. La narración es una herramienta de liderazgo eficaz para establecer una mayor...",
 "  Beginning Algebra ": "Introduction to basic algebraic operations and concepts, as well as the structure and use of algebra.",
 "  Pre-College English ": "Introductory course designed to improve your writing ability, through the use of active reading and an understanding of the co...",
 "  Pathways to climate change adaptation: the case of Small Island Developing States ": "This course provides an overview of climate change adaptation for the Small Island Developing States (SIDS) with a focus on th...",
 "  Fuels Refractory and Furnaces ": "Conventional and newer sources of energy, Characterization of fuels: Analysis and calorific value with problems, Principles of conversion of fuels: Carbonization...",
 "  Vaccines ": "This course will discuss issues regarding vaccines and vaccine safety: the history, science, benefits, and risks of vaccines, together with the controversies sur...",
 "Preparing for the AP* Biology Exam – Part 3: Evolution and Diversity ": "Preparing for the AP Biology exam requires a deep understanding of many different topics in biology as well as an understandin...",
 "  Copyright for Educators & Librarians ": "Fear and uncertainty about copyright law often plagues educators and sometimes prevents creative teaching. This course is a p...",
 "  Alien Worlds: The Science of Exoplanet Discovery and Characterization ": "Alien Worlds will explore the techniques that are used to discover and characterize the thousands of planets (called exoplanets) known outside of our solar syste...",
 "  The Future Of Storytelling ": "Are you interested in the mechanics of current fiction formats? Do you want to know how stories are told? Do you want to analy...",
 "  Symmetry, Structure and Tensor Properties of Materials ": "In 3.072x: Symmetry, Structure, and Tensor Properties of Materials, you will study the underlying structures of materials and you will deepen your understanding ...",
 "  The Meat We Eat ": "The Meat We Eat is a course designed to create a more informed consumer about the quality, safety, healthfulness and sustainab...",
 "  Learn Mandarin Chinese: Start Talking with 1.3 Billion People ": "Learn how to speak Mandarin Chinese, from everyday vocabulary to sentence structure.",
 "  Design Kit: Prototyping ": "Design Kit: Prototyping is a four-week course that will reinforce the prototyping process of human-centered design and help yo...",
 "  Human Physiology Lab ": "Introduction to physiology that uses various activities and exercises to explore the subject. Lab topics include: enzyme activ...",
 "  Ideas of the Twentieth Century ": "Learn how philosophy, art, literature, and history shaped the last century and the world today.",
 "  A Brief History of Humankind ": "The course surveys the entire length of human history, from the evolution of various human species in the Stone Age up to the political and technological revolut...",
 "  How to Survive Your PhD ": "You need to be smart to begin a PhD - but you need to be resilient to finish one. Between one-quarter and one-third of all research students never finish their d...",
 "  Biochemical Engineering ": "Basics of Biology, Overview of Biotechnology, Diversity in Microbial Cells, Cell Constituents, Chemicals for Life. Kinetics of Enzyme Catalysis. Immobilized Enzy...",
 "  How Writers Write Fiction ": "WP Director and Professor of English Christopher Merrill and a prominent author of contemporary fiction will co-teach the course, contextualizing contributing au...",
 "  International Criminal Law ": "The main objective of this course is to help students understand the basic knowledge of international criminal law. We will le...",
 "  The Next Generation Infrastructures ": "Explore the complexity and challenges of infrastructure systems (Transport, Energy, IT/Telecom and Water) in the 21st century....",
 "  Introduction to Drinking Water Treatment ": "Learn about urban water services, focusing on conventional technologies for drinking water treatment.",
 "  Metaliteracy: Empowering Yourself in a Connected World ": "This course will prepare participants to be active digital citizens who locate and evaluate information in 21st century social environments, including Massive Op...",
 "  Intro to Inferential Statistics ": "Intro to Inferential Statistics will teach you how to test your hypotheses and begin to make predictions based on statistical results drawn from data!",
 "  Big Data for Better Performance ": "Learn how you can predict customer demand and preferences by using the data that is all around you.",
 "  Understanding Violence ": "Violence is among the top three leading causes of injury and death in the US and globally. We will focus on different discipl...",
 "  Innovation and enterprise ": "Managing the innovation process is neither a scientific process nor a black art. This course examines a model for an innovatio...",
 "  Introduction to Bioethics ": "Introduction to Bioethics explores some of the most difficult - and fascinating - moral challenges we face in health, medicine...",
 "  FLOW Education: Facilitating Learning through Outdoor Watershed Education ": "This course is designed for classroom teachers (grades 4-8) to learn about watersheds and outdoor education using the Chesapeake Bay watershed as an example. The...",
 "  Poisonings in the Home and Community: Assessment and Emergency Response ": "This is a survey course on the principles of Clinical Toxicology. The emphasis will be pre-hospital and emergency hospital man...",
 "  Make Your Own 2048 ": "Ten minutes into this class you'll make your own completely personalized version of the insanely addictive game 2048. Even if you've never coded before. Pretty c...",
 "  Global Environmental Management ": "Learn about the best environmental technologies for a sustainable development and how they are managed in various settings aro...",
 "  Campaigns and Elections ": "Detailed study of the purpose and significance of campaigns and elections, especially their impact on the American political system. Explores the history and evo...",
 "  The Importance of Money in Business ": "Understand the role that money plays in business success and increase your career prospects with this free online course.",
 "  Descriptive Statistics ": "Learn about descriptive statistics, and how they are used and misused in the social and behavioral sciences. Learn how to critically evaluate the use of descript...",
 "  Case Studies in Personalized Medicine ": "Learn how advances in biomedicine hold the potential to revolutionize drug development, drug treatments, and disease preventio...",
 "  Drug Discovery, Development & Commercialization ": "Students will learn the process of drug discovery and development through specific examples of case studies to better understa...",
 "  Computation Structures - Part 1: Digital Circuits ": "Digital systems are at the heart of the information age in which we live, allowing us to store, communicate and manipulate information quickly and reliably.  6.0...",
 "  Intermediate Financial and Management Accounting ": "Intermediate Financial and Management Accounting is part two of a programme designed for anyone who is just starting out on their business, finance or accountanc...",
 "  Introductory Organic Chemistry - Part 1 ": "Organic chemistry course surveying introductory topics in structure and reactivity with an emphasis on structural fundamentals including electronic structure, co...",
 "  Novel Separation Processes ": "Fundamentals of Separation Processes; Basic definitions of relevant terms. Membrane based separation processes; fundamentals and various terms; classifications; ...",
 "  eHealth – Opportunities and Challenges ": "KIeHealthX will introduce students to the field of eHealth and its opportunities and challenges. During the course you will get to know the different concepts th...",
 "  Technology for Biobased Products ": "Learn the basics of process design for biobased products. From feedstock to biomaterials, chemicals and biofuels.",
 "  An Introduction to Global Health ": "Global Health is a new field within public health sciences that integrates the knowledge from fields such as epidemiology, med...",
 "  United States Health Policy ": "Learn the essentials of U.S. health care policy from some of the nation's top experts.",
 "  English Grammar and Style ": "Learn how to use a knowledge of how words work to write in the style that readers value and that the university and the profes...",
 "  Generating the Wealth of Nations ": "A survey of the history of economic development in the world in the past 300 years.",
 "  Foundations for Assisting in Home Care ": "This course is intended as a self-study course for those interested in exploring a career as a Home Health Aide or Personal Ca...",
 "  Preparing for the AP* Chemistry Exam - Part 2 ": "This course attempts to cover the topics in a traditional AP Chemistry sequence. It includes modern atomic theory, periodic ta...",
 "  Useful Genetics ": "This course will give students a thorough understanding of gene function and inheritance, and will enable them to apply this u...",
 "An Introduction to the U.S. Food System: Perspectives from Public Health ": "Explore how food intersects with public health and the environment as it moves from field to plate.",
 "  Finance for Non-Financial People ": "In this course gain a basic understanding of finance and accounting concepts to drive your organization's growth. Upon completion of this course, you will have g...",
 "  JavaScript Basics ": "Learn JavaScript syntax and coding conventions that web developers use to create interactive and dynamic websites while you create an online résumé for your port...",
 "  An Introduction to Population Health ": "This MOOC is aimed at anyone wishing to understand the basics of population health. Our aim is to prompt any participant to reconsider the decisions they make ab...",
 "  Introduction to Electronics ": "This course introduces students to the basic components of electronics: diodes, transistors, and op amps. It covers the basic...",
 "  Managing Addiction: A Framework for Successful Treatment ": "Addiction is such a common problem today that clients experiencing alcohol, nicotine or other drug problems present in many di...",
 "  Global Health: Interdisciplinary Overview ": "This course proposes an overview of current global health challenges drawing on the insights of several academic disciplines including medicine, public health, l...",
 "  Saving Lives Millions at a Time: Global Disease Control Policies & Programs ": "Public Health focuses on the health of entire populations, fighting disease on a massive scale.",
 "  Fundamentals of Neuroscience Part 2: Neurons and Networks ": "In this second module (MCB80x.2) we will explore how neurons communicate with each other.  We will investigate the collective behavior of neurons in small circui...",
 "  Space Mission Design and Operations ": "Space exploration is truly fascinating. From the Sputnik mission to the assembly and exploitation of the International Space Station or the Apollo program, we ar...",
 "  On Ramp to AP* Biology ": "This course will help students who have taken an introductory level biology course get ready for more advanced courses, includ...",
 "  Introductory Organic Chemistry - Part 2 ": "Organic chemistry course surveying introductory topics in structure and reactivity with an emphasis on elementary reaction mechanisms.",
 "CLEP Information Systems and Computer Applications, Part 1: IT ": "This is the first part of an introductory business information systems series, designed to help you pass the CLEP Information Systems and Computer Applications e...",
 "  The Music of the Rolling Stones, 1962-1974 ": "This course will survey the music of the Rolling Stones, beginning with the roots and first formation of the band in the early 1960s, and following the group thr...",
 "  Statistics One ": "Statistics One is designed to be a friendly introduction to very simple, very basic, fundamental concepts in statistics.",
 "Introduction to Classical Music ": "This course will focus on Western classical music of the eighteenth and nineteenth centuries; it is designed for people who are passionate about classical music ...",
 "  Urban Sewage Treatment ": "This course will focus on basic technologies for the treatment of urban sewage. Unit processes involved in the treatment chain will be described as well as the p...",
 "  Creating Site-Specific Dance and Performance Works ": "This course will look into the process of creating live site-specific choreography/performance works from conception, production to performance. Site-specific da...",
 "  Management Accounting ": "Learn management accounting techniques to support businesses to plan, control, monitor and enhance performance.",
 "  Good Brain, Bad Brain: Drug Origins ": "Explore our past, present and future understanding of drugs with this free course. Where do drugs come from? How do they work?...",
 "  Intro to Physics ": "Study physics abroad in Europe -- virtually! Learn the basics of physics on location in Italy, the Netherlands and the UK, by answering some of the discipline's ...",
 "Physics of Materials ": "This course will discuss the approaches used to understand important properties of materials and the relationships between these properties. Elementary quantum m...",
 "  Introduction to Clinical Neurology ": "An overview of the relevant aspects of the epidemiology, clinical presentation, basic disease mechanisms, diagnostic approaches and treatment options of the most...",
 "  Designing Technology for Learning ": "Designing technologies that facilitate learning. Beyond usability, technology for learning has to engage, trigger prior knowle...",
 "  Calculus 1A: Differentiation ": "How does the final velocity on a zip line change when the starting point is raised or lowered by a matter of centimeters?  Wha...",
 "  Fundamentals of Fluid Power ": "Fluid power has the highest power density of all conventional power-transmission technologies. Learn the benefits and limitations of fluid power, how to analyze ...",
 "  AP® Macroeconomics ": "Learn key concepts and AP® Macroeconomics material from top AP instructors, including many of the same high school teachers an...",
 "  Calculus One ": "Calculus One is a first introduction to differential and integral calculus, emphasizing engaging examples from everyday life.",
 "  Introduction to Probability Theory ": "We will cover the following concepts from probability. Probability space, random variables, distribution functions, expectation, conditional expectation, Charact...",
 "  The secret power of brands ": "Get under the skin of brands as we reveal the secret powers behind the most potent commercial and cultural force on the planet.",
 "Mechanics of Soft Materials ": "The goal of this course is to expose the students and researchers of these diverse research interests to the principles of mechanics and its rich mathematical st...",
 "  Globalization's Winners and Losers: Challenges for Developed and Developing Countries ": "Who are the winners and losers of globalization? What should be done to improve outcomes for all?",
 "  High Speed Aero Dynamics ": "The course is designed as a core course for the undergraduate students of Aerospace engineering and contains the basic material essential for a foundation of com...",
 "  Control of Mobile Robots ": "Learn about how to make mobile robots move in effective, safe, predictable, and collaborative ways using modern control theory.",
 "  Cracking the Creativity Code: Part 1- Discovering Ideas ": "Creativity is an acquired skill that improves with practice. Creativity changes the world and enriches people’s lives. It take...",
 "  Introduction to Marketing ": "Marketing is a crucial function in all businesses and organizations, and is becoming increasingly crucial to success in our modern global economy. This course, r...",
 "  Collaboration and Communication in Healthcare: Interprofessional Practice ": "Interprofessional collaborative practice is key to safe, high quality, accessible, patient-centered care. This course aims to introduce health professions learne...",
 "Greek and Roman Mythology ": "This course will focus on the myths of ancient Greece and Rome, as a way of exploring the nature of myth and the function it p...",
 "  Ebola in Context: Understanding Transmission, Response and Control ": "How has the Ebola outbreak become a humanitarian emergency? Learn about the science behind the crisis.",
 "  Basic Steps in Magnetic Resonance ": "A MOOC to discover basic concepts and a wide range of intriguing applications of magnetic resonance to physics, chemistry, and biology",
 "History of Europe, 1000 to 1800 ": "Examination of the political, economic, social, religious, and intellectual history of Europe, from the Middle Ages to the 18t...",
 "  Flight dynamics II - Airplane stability and control ": "Basic concepts of stability and control. Subdivisions of the subject. Static longitudinal stability and control. Contributions of major components.",
 "  Steel Making ": "Introduction; The Science Base of Iron and Steelmaking; Modern Steelmaking I: Oxygen Steelmaking; Modern Steelmaking II: Electric Arc Furnace Steelmaking; Steelm...",
 "  IELTS Academic Test Preparation ": "Prepare for the IELTS Academic tests in this comprehensive, self-paced course covering listening, speaking, reading and writing.",
 "  Instability andPatterning of Thin Polymer Films ": "This course will expose students to the science of sub-micron, meso and nanoscale patterning of surfaces with special emphasis on thin soft films like gels, poly...",
 "  Exercise Physiology: Understanding the Athlete Within ": "Learn about the physiological responses to acute and chronic exercise and their relevance for athletic performance.",
 "  Social Entrepreneurship ": "Join us and learn how to develop, test, and deploy high-impact solutions to society's toughest challenges.",
 "  Financial Analysis ": "Le MOOC est une expérience pédagogique innovante qui a déjà séduit des millions de personnes dans le monde (plus de 6 millions d'inscriptions à ce jour). Partici...",
 "  Engineering Materials & Materials Processing ": "Detailed study of the materials with properties that have been optimized for a set of desired applications and their production. Explores atomic structure, cryst...",
 "  Psychology of Popularity ": "The level of popularity you experienced in childhood and adolescence is still affecting you today in ways that you may not even realize. Learn about how psychol...",
 "  Art of Ancient Egypt and the Ancient Near East ": "Detailed introduction to the major artistic and architectural traditions of Ancient Egypt and the Ancient Near East.",
 "  Computing: Art, Magic, Science - Part II ": "Throughout this course, you will learn programming concepts and techniques, and practice them immediately through advanced browser-based tools that let you write...",
 "  An Introduction to Electronics Systems Packaging ": "The objective of this course is to sensitize the undergraduate students and graduate students to the all-important multidisciplinary area of electronics systems ...",
 "  Prototyping Interaction ": "Prototyping means making your ideas tangible. With prototypes you can communicate, test and iterate on your design. In this co...",
 "  Global Sustainable Energy: Past, Present and Future ": "Students will explore energy consumption patterns including individuals, countries and the entire globe. These patterns will i...",
 "  AP® Physics 1: Challenging Concepts ": "This course covers 8 different challenging topics in AP® Physics 1. Well-respected AP instructors from around the USA will lea...",
 "  Question Reality! Science, philosophy, and the search for meaning ": "Clique aqui​ para a versão em português. How much can we know of the physical world? Can we know everything? Or are there fundamental limits to how much we can e...",
 "  Human-Computer Interaction Design ": "Helping you build human-centered design skills, so that you have the principles and methods to create excellent interfaces wit...",
 "  R Programming ": "Learn how to program in R and how to use R for effective data analysis. This is the second course in the Johns Hopkins Data Sc...",
 "Introduction to Sociology ": "In this class we will cover the essentials of sociology, to help you better understand your own life and situations far from your experience.",
 "  Introduction to Global Sociology ": "Understand your social location in a globally interconnected cultural and economic landscape.",
 "  Exploring Neural Data ": "Try your hand at understanding the brain by learning to analyze neural data yourself! Working with real neural data sets from...",
 "  Financial Engineering and Risk Management Part I ": "This course provides an introduction to various classes of derivative securities and we will learn how to price them using \"ri...",
 "  Principles of Physical Metallurgy ": "The aim of this course is to provide a basic understanding of the underlying principles that determine the evolution of microstructures in metals and alloys duri...",
 "  Introduction to Statistics: Probability ": "An introduction to probability, with the aim of developing probabilistic intuition as well as techniques needed to analyze simple random samples.",
 "  Light, Spike, and Sight: The Neuroscience of Vision ": "Vision may feel effortless: you open your eyes, and the world appears. But the process of focusing light into image on the bac...",
 "  More Introduction to Financial Accounting ": "The course builds on my Introduction to Financial Accounting course, which you should complete first. In this course, you will learn how to read, understand, and...",
 "  Humanitarian communication : Addressing key challenges ": "Learn how to address the main challenges of communication in humanitarian settings and how to implement a communication plan in the midst of humanitarian action....",
 "  Preparing for the AP* Biology Exam – Part 4: Ecology ": "Preparing for the AP Biology exam requires a deep understanding of many different topics in biology as well as an understandin...",
 "Computational Techniques ": "The development of fast, efficient and inexpensive computers has significantly increased the range of engineering problems that can be solved reliably. Computati...",
 "  Listening to World Music ": "Learn the ideas and vocabulary for listening to world music, and examine the music of several world music cultures and how they have entered into mainstream popu...",
 "  Obesity: Causes and Consequences ": "Obesity is a global epidemic. As the world gets fatter, explore its impact on our health and lives, with this free online cour...",
 "  Electricity & Magnetism ": "Electricity & Magnetism serves as an introduction to electricity and magnetism, following the standard second semester college physics sequence. It begins with e...",
 "  The Future of Humankind ": "This course will take students on an extraordinary journey – the beginning of a massive transformation of humankind. Nothing remotely like this had ever happened...",
 "  Intercultural Communication ": "We live in an increasingly globalized world. Technology enables us to do business just as easily with our neighbors as with a businessperson thousands of miles ...",
 "  Jazz Improvisation ": "Learn the basic concepts of improvisation from Gary Burton, one of the most renowned improvisers in the jazz world, including the mental, melodic, and harmonic p...",
 "  Thermodynamics ": "The thermodynamic functions H, A and G, concept of chemical potential, equations for a closed system, Maxwell’s relations, thermodynamic analysis of processes –...",
 "  Introduction to Evolutionary Biology and Ecology ": "Examination of how organisms evolve over time, with particular emphasis on natural selection, evolution, speciation, phylogeny and taxonomy, and aspects of genet...",
 "  Introduction to Computer Programming, Part 2 ": "This 6-week course builds on the basic foundation in computer programming, and introduces the Object Oriented Programming paradigm.",
 "  Managerial Accounting: Planning, Standard Costing, and Performance Measurement ": "The focus of managerial accounting is to provide key information to internal parties (e.g., managers) to enable them to make better business decisions. This cour...",
 "  Advanced Inorganic Chemistry ": "Detailed study of inorganic chemistry, with particular emphasis on symmetry and group theory, molecular orbital theory, nomenclature and coordination of transiti...",
 "  Storytelling for Change ": "This six-module experiential course by +Acumen is focused on the use of storytelling as an effective leadership tool to more powerfully connect with audiences an...",
 "  The Modern and the Postmodern ": "This course examines how the idea of \"the modern\" develops at the end of the 18th century and how being modern (or progressive, or hip) became one of the crucial...",
 "  Proteomics: Principles and Techniques ": "An introduction to proteomics: Basics of protein structure and function, An overview of systems biology, Evolution from protein chemistry to proteomics; Abundanc...",
 "  Scaling operations: Linking strategy and execution ": "Over the past several decades, operations strategy has played an increasingly important role in business success. In this cour...",
 "  English for Doing Business in Asia - Speaking ": "Introducing strategies for developing your spoken English communication skills in the context of doing business in Asia.",
 "  English Composition II ": "Introductory course on basic research concepts and techniques, including ways to build academic research into effective writing processes.",
 "  Understanding Russians: Contexts of Intercultural Communication ": "Learn about the intercultural communication process using Russian –Western communication as an example. Look at the interrelat...",
 "  Organic Solar Cells - Theory and Practice ": "Learn about a new generation of solar cells, organic solar cells, that promise an answer to the energy demands of the future.",
 "  Volcanic Eruptions: a material science. ": "Volcanic eruptions are a powerful demonstration of the energy of the Earth´s interior. A materials-based understanding of the evolution of erupting systems provi...",
 "  Everything is the Same: Modeling Engineered Systems ": "Learn modeling and analysis techniques for electrical, mechanical, and chemical systems and discover how engineered systems that seem very different are actually...",
 "  Latin American Migration ": "This course is about the historical, sociocultural, and economic causes of Latin American migration, and the economic, politic...",
 "  Precalculus II ": "Examination of the definitions of the basic trig functions, exploration of their properties, and the study of trigonometric equations and identities, the laws of...",
 "  Digital Marketing Channels: The Landscape ": "Learn the role of digital channels in an integrated marketing campaign and why you need a digital strategy. Interact with the content and hear from industry expe...",
 "  Introduction to Computer Programming, Part 1 ": "This 6-week course provides students with a foundation in computer programming.",
 "  Introduction to Sociology ": "Sociology is about people. Each individual is unique and idiosyncratic. Yet, when we come together for a common purpose, we try to conduct ourselves in a manner ...",
 "  Self-Assessment – Developing Your Strengths ": "This self-paced career development course will help you identify your strengths and interests and align your passions with a viable career path. Through guided s...",
 "  English Composition I ": "Introductory course on composition, developing the ability to write clear, grammatically-sound expository and persuasive prose pieces.",
 "  Imagining Other Earths ": "Are we alone? This course introduces core concepts in astronomy, biology, and planetary science that enable the student to sp...",
 "  Writing II: Rhetorical Composing ": "Rhetorical Composing engages you in a series of interactive reading, research, and composing activities along with assignments designed to help you become more e...",
 "  Stonehenge ": "The most spectacular monument of the Neolithic is now a British icon and a World Heritage Site. Explore 5,000 years of Stonehe...",
 "  Scratch: Programmeren voor kinderen (8+) ": "Programmeren is steeds belangrijker in onze wereld. En jong geleerd is oud gedaan. Deze MOOC bevat filmpjes en opdrachten waarmee kinderen zelf kunnen leren prog...",
 "  Introduction to Health and Wellness ": "This 3 credit health and wellness course focuses on the latest trends in health, nutrition, physical activity, and wellness. F...",
 "  Case-Based Introduction to Biostatistics ": "Learn to frame and address health-related questions using modern biostatistics ideas and methods.",
 "  Making Math Matter ": "In this course you will examine real world problems -- rescue the Apollo 13 astronauts, stop the spread of epidemics, and fight forest fires -- involving differe...",
 "  Engineering: Building with Nature ": "If you’re interested in the concept of building with nature, then this is the engineering course for you. This course explores...",
 "  Positive Behavior Support for Young Children ": "Learn the evidence-based models to promote social-emotional development for young children.",
 "  Organic Electronic Devices ": "Organic electronic materials are defined broadly as carbon-based materials that are capable of transporting charge both in liquid-supported systems and in the so...",
 "  Personal & Family Financial Planning ": "Personal and Family Financial Planning will address many critical personal financial management topics in order to help you learn prudent habits both while in sc...",
 "  Feminist Politics ": "Introductory course on feminist political thought, examining how feminists have reacted to and shaped conventional political theory. Discusses the “waves” of fem...",
 "  Financial Accounting Made Fun: Eliminating Your Fears ": "Are financial statements a mystery to you? Do all those terms and metrics make your head spin? Do you avoid conversations with your finance leaders because you a...",
 "  Mechanics I ": "Introduction to the study of mechanics, or how forces affect bodies in motion. Reviews Newtonian physics and its application to statics systems, analyzes static ...",
 "Programming in Scratch ": "Want to solve challenging problems? Want to learn some computer science? Want to make amazing games, drawings, and songs online?   This is a course that introd...",
 "  Information Theory ": "This course is an introduction to information theory, which emphasizes fundamental concepts as well as analytical techniques. Specific topics include: Informatio...",
 "  Calculus Two: Sequences and Series ": "Calculus Two: Sequences and Series is an introduction to sequences, infinite series, convergence tests, and Taylor series. The course emphasizes not just gettin...",
 "  Our Energetic Earth ": "Learn how our world’s energy forces – from wind and waves to storms and currents – animate the Earth’s surface and allow our planet to support life.",
 "  Molecular Basis of Nutrition-Related Diseases ": "Nutrition and health is a matter of concern to many people. Most often, we ask what kind of food is healthy or what we should ...",
 "  Introduction to Molecular and Cellular Biology ": "Detailed introduction to molecular biology, including proteins, carbohydrates, lipids, and nucleic acids, water, and other compounds that make up the cell. Parti...",
 "  Emerging Trends & Technologies in the Virtual K-12 Classroom ": "Learn about emerging trends and technologies in K-12 virtual instruction. Join us as we explore this dynamic landscape and investigate how we can more deeply eng...",
 "  Preparing for the AP* Physics 1 Exam ": "This is a challenging course designed to help high school students prepare for the AP* Physics 1 test. The course covers all o...",
 "Fundamentals of Electrical Engineering ": "This course probes fundamental ideas in electrical engineering, seeking to understand how electrical signals convey information, how bits can represent smooth si...",
 "Biochemistry ": "Examination of the biological and chemical processes necessary to sustain life. Topics include: the structure and synthesis of amino acids and proteins, enzymati...",
 "  Digital Analytics for Marketing Professionals: Marketing Analytics in Practice ": "This course builds on the theory and foundations of marketing analytics and focuses on practical application by demystifying t...",
 "  Comic Books and Graphic Novels ": "Comic books have arrived! \"Comic Books and Graphic Novels\" presents a survey of the comic book canon and of the major graphic novels in circulation today. Its go...",
 "  eTourism: Communication Perspectives ": "This Swiss-made MOOC takes you on a terrific journey into eTourism and online communication. You will feel the pulse of ICTs a...",
 "Business Law and Ethics ": "Introductory course to the laws and ethical standards that managers must abide by while conducting business. Explores the lega...",
 "  K-12 Blended & Online Learning ": "This course introduces teachers and interested adults to K12 blended and online learning. Participants will design a blended or online unit and develop one modul...",
 "  Flight Vehicle Aerodynamics ": "Discover the concepts, theories, models, and methods used in the aerodynamic analysis and design of modern aircraft.",
 "  The Engineering of Structures Around Us ": "In this introductory course, you’ll learn some engineering principles that can be applied to structural systems everywhere: in nature, in furniture, in mechanica...",
 "  The Evolving Universe ": "A survey of the physical universe and its constituents, including the formation, function, and evolution of stars, galaxies, black holes, quasars, and more.",
 "  Maps and the Geospatial Revolution ": "Learn how advances in geospatial technology and analytical methods have changed how we do everything, and discover how to make...",
 "  Cellular and Molecular Immunology ": "Properties of Immune system. Innate immune system. Adaptive immune system. Antibodies and Antigens. Major histocompatability c...",
 "  Behavioral Medicine: A Key to Better Health ": "Learn how to change everyday behaviors for healthier lives using basic behavioral medicine concepts. Test yourself with virtua...",
 "  AP® Biology - Part 3: Evolution and Diversity ": "Preparing for the AP Biology exam requires a deep understanding of many different topics in biology as well as an understandin...",
 "  Algebra ": "This course is taught so that students will acquire a solid foundation in algebra. The course concentrates on the various functions that are important to the stu...",
 "  Science, Technology, and Society in China III: The Present & Policy Implications ": "This course is the third in a trilogy of short courses. In this final part, we integrate what we have learned in the previous ...",
 "  Architecture 101 - Part I ": "From nothingness to place: To learn to stare, observe and see places like architects do. To transform a place into a state of ...",
 "  Intro to Psychology ": "Go on a journey through psychological concepts and principles to enable you to gain a more in-depth understanding of human thought and behavior.",
 "Business Statistics ": "Introductory survey of quantitative methods (QM), or the application of statistics in the workplace. Examines techniques for gathering, analyzing, and interpreti...",
 "  Logic: Language and Information 1 ": "This is an introduction to formal logic and how it is applied in computer science, electronic engineering, linguistics and phi...",
 "  Introduction to Nutrition: Food for Health ": "“You are what you eat”- learn the fundamentals of nutrition and how it can affect human health.",
 "  Logic: Language and Information 2 ": "This is an introduction to predicate logic and how it is applied in computer science, electronic engineering, linguistics, mat...",
 "  Sports and Society ": "This course explores the role of sports around the world, and how the games we watch and play shape identity, culture, and soc...",
 "  Humanity and Nature in Chinese Thought ": "Think along with Classical Chinese masters as they explore and debate how and where we can find ethical guidance in nature.",
 "  Discrete-Time Signal Processing ": "6.341x is designed to provide both an in-depth and an intuitive understanding of the theory behind modern discrete-time signal processing systems and application...",
 "  Comparative Media Systems ": "Whether you know it or not, you are actively contributing to a comprehensive media environment forged on both regional and global levels – even when you are priv...",
 "  Nudge-it: Understanding obesity ": "Nudge-it is an multi-disciplinary European research project studying new ways of establishing and reinforcing healthy eating h...",
 "  Italian Language and Culture: Intermediate ": "In this language course, you will enhance your Italian language skills, enrich your vocabulary and expand your conversational ...",
 "  Discovery Precalculus: A Creative and Connected Approach ": "In Discovery Precalculus - A Creative and Connected Approach, students deepen and extend their knowledge of functions, graphs, and equations from their high scho...",
 "  Managing My Investments ": "Gain the skills to manage your investments: analyse portfolio risk and plan your pension, with this free online course.",
 "  Health for All Through Primary Care ": "This course explores why primary health care is central for achieving Health for All. It provides examples of how primary health care has been instrumental in ap...",
 "  How Things Work 1 ": "Designed for non-science students, this course is a practical introduction to physics and science in everyday life. It considers objects from the world around us...",
 "  Math behind Moneyball ": "Learn how probability, math, and statistics can be used to help baseball, football and basketball teams improve, player and li...",
 "  Electronics ": "It is a basic introductory course on Electronics and its Principles. It starts with basics of p-n junctions leading to diodes and transistors. The circuit applic...",
 "  Introduction to Communication Science ": "Since Antiquity, scholars have appreciated the importance of communication: as social beings, we cannot exist without communication. The course extends beyond th...",
 "  Single-Variable Calculus I ": "Survey of concrete applications of how calculus is used and, more importantly, why it works, through the introduction of topics including limits, derivatives, an...",
 "  Beyond Silicon Valley: Growing Entrepreneurship in Transitioning Economies ": "Explore how communities in transitioning economies around the world are working to enable the growth of entrepreneurship when ...",
 "  Economics of Money and Banking, Part One ": "Introduction to a “money view” of economic activity for modern times, building on the intellectual traditions of British central banking and American institution...",
 "  Climate Change in Four Dimensions ": "This course views climate change from a variety of perspectives at the intersection of the natural sciences, technology, and t...",
 "  Recovering the Humankind Past and Saving the Universal Heritage ": "Archaeology has as its objective the recovery and revival of humankind past, and as its aim the rescue and preservation of cul...",
 "  Microbiology ": "Study that focuses on understanding microorganisms including their taxonomy and identification, chemistry and metabolism, growth, reproduction, and genetic chara...",
 "  Health Leadership ": "In this course, we explore what it means to be a leader in the context of healthcare. How is it different to leadership in other industries? What are the partic...",
 "  Preparing for the AP* Physics 2 Exam – Part 2: Electricity and Magnetism ": "Preparing for the AP Physics 2 exam requires a deep understanding of many different topics in physics as well as an understand...",
 "  The Art of Poetry ": "The art of poetry gives pleasure and invites knowledge. This course is based on a conviction that the more you know about an a...",
 "  Introduction to Digital Sound Design ": "Sounds and music are embedded in almost every aspect of daily life. This course will provide an overview of the fundamental pr...",
 "  Dog Perception and Cognition ": "The world as it presents itself to dogs is not the same as the world humans experience. While dogs are far from blind, the experience of smell and sound plays a ...",
 "  The Civil War and Reconstruction - 1861-1865 ": "A New Birth of Freedom: The Civil War, 1861-1865 narrates the history of the American Civil War.  While it examines individual...",
 "  Computing: Art, Magic, Science ": "Computing is an art. Computing is also, for most people, magic; this course will enable you to see what lies beyond the appare...",
 "  Copyright ": "Copyright explores the current law of copyright and the ongoing debates concerning how that law should be reformed.",
 "  Justice ": "Justice is an introduction to moral and political philosophy, including discussion of contemporary dilemmas and controversies....",
 "  Health in Numbers: Quantitative Methods in Clinical & Public Health Research ": "Principled investigations to monitor and thus improve the health of individuals are firmly based on a sound understanding of modern quantitative methods. This in...",
 "  Chemistry: Concept Development and Application ": "This introduction to fundamental chemical concepts of atomic and molecular structure will emphasize the development of these concepts from experimental observati...",
 "  On Strategy: What Managers can learn from Philosophy - Part 2 ": "Part 2 of the MOOC: 3 new lectures",
 "Accountant in Business ": "This business and finance course will help you understand business in the context of its environment, including economic, legal, and regulatory influences on suc...",
 "  Biology for Voters ": "Science plays an ever increasing role in the decisions of all people as they go about their daily lives, and as they select representative leadership in a democr...",
 "  Becoming Human: Anthropology ": "Gain an introductory understanding of evolution, including how we evolved from primates and became human.",
 "  Macroeconomic Principles ": "The macroeconomy is the sum of all our productive efforts, spending, and income. Economic outcomes are the result of our complex interactions with other people, ...",
 "  Introduction to Environmental Law and Policy ": "Interested in learning about how the law analyzes issues and resolves disputes involving pollution, natural resources, endangered species, environmental justice,...",
 "  Philosophy of Science ": "This course is a survey of philosophical issues surrounding the concepts and practices of modern science. The course covers the major areas of contemporary phil...",
 "  Organic Chemistry II ": "Examination of the nomenclature, properties, and reactivity of: ethers and epoxides, thiols and sulfides, conjugated dienes, benzene and other aromatic compounds...",
 "  Solar Energy ": "Discover the power of solar energy and design a complete photovoltaic system.",
 "  Introduction to Public Administration ": "Detailed introduction to the role of the public bureaucracy in American society and the interplay of politics and public admin...",
 "  Sleep: Neurobiology, Medicine, and Society ": "The objective of this course is to give students the most up-to-date information on the biological, personal, and societal relevance of sleep. Personal relevance...",
 "  Canine Theriogenology for Dog Enthusiasts ": "This course will help anyone who loves dogs to better understand their dog's reproductive health and how to control its reproduction. This includes understanding...",
 "  Structure Standing Still: The Statics of Everyday Objects ": "The Statics of Everyday Objects is a course about how structures react to forces exerted on them while remaining unmoved.",
 "Preparing for the AP* Chemistry Exam - Part 1 ": "This course attempts to cover the topics in a traditional AP Chemistry sequence. It includes modern atomic theory, periodic ta...",
 "  The Science of Safety in Healthcare ": "This course will introduce the basic principles of the science of safety in healthcare. Course content will be of relevance to members of the healthcare deliver...",
 "  Preventing Chronic Pain: A Human Systems Approach ": "Chronic pain is at epidemic levels and has become the highest-cost condition in health care. This course uses both creative and experiential learning to better u...",
 "  Physical Chemistry I ": "Introductory survey of thermodynamics in classical mechanics systems. Topics include: the first, second, and third laws of thermodynamics, energy, work, enthalpy...",
 "  Basic Behavioral Neurology ": "This course will survey fundamental principles of cognitive and behavioral neurology. The emphasis of the course will be on the neural mechanisms underlying aspe...",
 "  Career Edge: Resume, Networking and Interview Skills ": "With only a small window of opportunity to make a lasting impression on prospective employers, what should you do to get noticed? This career development course ...",
 "Latino Popular Culture for the Clueless ": "All your questions answered in seven exciting episodes!",
 "  Introduction to Forensic Science ": "Understand how basic scientific principles underpin forensic science and can contribute to solving criminal cases.",
 "  The Immune System: New Developments in Research - Part 1 ": "This course will provide fundamental knowledge in immunology as well as some advanced topics from cutting-edge research result...",
 "  Introduction to Western Art History: Proto-Renaissance to Contemporary Art ": "Introductory survey of the important movements and influential figures in Western art from the Proto-Renaissance in Italy to the contemporary art of the twentiet...",
 "  Principles of Written English, Part 1 ": "An introduction to academic writing for English Language Learners, focusing on essay development, grammatical correctness, and...",
 "  Introduction to Electromagnetism ": "Examination of waves and oscillations in extended objects, sources and laws that govern static electricity and magnetism, Maxwell’s equations, optics, and Einste...",
 "  Understanding Creativity and Creative Writing ": "In the context of the rapid growth of communication technologies and globalization, new debates and concerns regarding creativity have emerged. These discussions...",
 "  Re-Enchanting the City - Designing the Human Habitat ": "The city is now the predominant human habitat. How do we make hyper-dense cities of the future green, livable and poetic?",
 "  International Human Rights Law: Prospects and Challenges ": "This course introduces the international and domestic laws, institutions, and legal and political theories that protect basic ...",
 "  Quantum Mechanics of Molecular Structures ": "Knowing the geometrical structure of the molecules around us is one of the most important and fundamental issues in the field of chemistry. This course introduce...",
 "  The Body Matters ": "Exercise is promoted as a fundamental component of a healthy lifestyle. Ever wonder why? Exercise is more than just an “art of...",
 "  Organic Chemistry I ": "Detailed introduction to the structure, bonding and reactivity of organic molecules. Surveys valence bond theory and bonding, covalent bonding properties, includ...",
 "  Statistics for Business - II ": "Statistics is a versatile discipline that has revolutionized the fields of business, engineering, medicine and pure sciences. This course is Part 2 of a 4-part s...",
 "  Preparing for the AP* Environmental Science Exam - Part 4: Exam Review ": "Preparing for the AP Environmental Science exam requires a deep understanding of many different topics in physics as well as a...",
 "  Understanding the UK's 2015 General Election ": "Learn about the UK's 2015 general election: how does the system work, what is at stake, and how will it affect you? Whether or...",
 "  Water: The Essential Resource ": "Using water as the unifying theme, explore ocean and freshwater topics and instructional strategies to integrate environmental content in your teaching practice....",
 "  How Writers Write Poetry ": "The course presents a curated collection of short, intimate talks on craft by two dozen acclaimed poets writing in English. Cr...",
 "  Career Edge: Analytical Problem Solving and Design Thinking ": "This career development course will teach you processes for framing problems, isolating the root cause, and taking action to reach a solution. You will use techn...",
 "  Climate Change ": "This course develops an interdisciplinary understanding of the social, political, economic and scientific perspectives on clim...",
 "  Digital Analytics for Marketing Professionals: Marketing Analytics in Theory ": "Learn the introductory theory and strategy behind marketing analytics that provides marketers with the foundation needed to ap...",
 "  Human Physiology ": "Study of the physiological (functional) processes that occur within the human body, with particular attention on enzyme activi...",
 "  Elementary Data Structures ": "Introductory survey of the specification and implementation of basic abstract data types and their associated algorithms. Structures discussed include: stacks, q...",
 "  Introduction to Complexity ": "In this course you'll learn about the tools used by scientists to understand complex systems. The topics you'll learn about include dynamics, chaos, fractals, in...",
 "  Introduction to Sustainable Development ": "The Age of Sustainable Development gives students an understanding of the key challenges and pathways to sustainable developme...",
 "  Archeology’s Dirty Little Secrets ": "Admit it — you wanted to be an archaeologist when you grew up... This course builds on that enthusiasm, while radically expand...",
 "  Reputation Management in a Digital World ": "In this course, you’ll take on the role of a communications manager for a fictional organisation, making key decisions that will affect its online reputation. Yo...",
 "  Introduction to Engineering and Engineering Mathematics ": "The goal of this course is to provide high school students and college freshman a broad outline of engineering and help them decide on a career in engineering. T...",
 "Anthropology of Current World Issues ": "How is anthropology changing the world and what can you learn from this?",
 "World Regional Geography ": "The course will begin with a primer of complex systems theory and then will discuss the theory’s influence on the science of s...",
 "  Understanding Einstein: The Special Theory of Relativity ": "This course offers you the opportunity to gain a deeper understanding of the life and work of the young Albert Einstein and especially his mind-bending special t...",
 "  Jazz Appreciation ": "Listen and learn about the artists, eras, and musical methods that make jazz a great original art form.",
 "  Introduction to Computing using Python ": "In this computer science course, you will learn about foundational computing principles, such as how to write and read compute...",
 "  Moral and Political Philosophy ": "Survey of the development and application of moral reasoning skills to contemporary social and political issues. Topics includ...",
 "Crafting an Effective Writer: Tools of the Trade ": "Learn to become an effective builder of sentences using the basic tools of grammar, punctuation, and writing.",
 "  Visualizing Algebra ": "Learn the basics of Algebra through intuition and problem solving! From fractions to factors to functions, we’ll cover a breadth of topics.",
 "  The Land Ethic Reclaimed: Perceptive Hunting, Aldo Leopold, and Conservation ": "The rich history of wildlife management and recreational hunting plays an important role in the evolving face of conservation. This course will explore the ethic...",
 "  Introduction to Water and Climate ": "Water is essential for life on earth and of crucial importance for society. Also within our climate water plays a major role. ...",
 "  Diabetes: Diagnosis, Treatment, and Opportunities ": "This multidisciplinary course will emphasize the diagnosis and treatment of diabetes. Topics will include patient self-managem...",
 "  English Composition ": "Language, and the ability to communicate effectively are critical skills in the global economy. Writing and composition are vital to communicating your ideas cle...",
 "  Presumed Innocent? The Social Science of Wrongful Conviction ": "The United States criminal justice system is typically an accurate and efficient system-although, as a human creation, it is n...",
 "  Principles Of Human Communication ": "This course provides an introduction to the human communication concentration in the communications major. This course will introduce you to communication princ...",
 "The Computing Technology Inside Your Smartphone ": "We use our smartphones to communicate, to organize our lives, to find information, and to entertain ourselves. All of this is possible because a smartphone conta...",
 "  Mechanical Behavior of Materials ": "Why do materials deform and break? How does nature engineer materials to be light yet stiff and strong?",
 "  Vaccine Trials: Methods and Best Practices ": "This course will explore the process of evaluating investigational vaccines in clinical trials including informed consent, recruitment, enrollment, safety evalua...",
 "  Principles of Marketing ": "Detailed introduction to the entire marketing process, identifying a customer base and the range of marketing decisions that an organization must make in order t...",
 "  Growing our Future Food: Crops ": "How to feed the world without exhausting planetary reserves? – understand the basics of crop production and explore the opport...",
 "  Preparing for the AP* Environmental Science Exam - Part 3: Pollution and Resources ": "Preparing for the AP Environmental Science exam requires a deep understanding of many different topics in environmental scienc...",
 "  Introduction to Computer Science ": "In this introduction to computer programming course, you’ll learn and practice key computer science concepts by building your ...",
 "  The Letters of the Apostle Paul ": "The course “Early Christianity: The Letters of Paul” explores the context of these letters in the Roman Empire and the impact ...",
 "  Financial Accounting ": "This course introduces the principles of financial accounting, and will allow learners to demonstrate technical proficiency in the use of double-entry techniques...",
 "  New Venture Finance: Startup Funding for Entrepreneurs ": "Learn how to get your new venture funded. Understand capital structure for new ventures. Develop an understanding of investor ...",
 "  Geospatial Intelligence & the Geospatial Revolution ": "Learn how the revolution in geospatial technology combined with the tradecraft of Geospatial Intelligence (GEOINT) have change...",
 "  Sustainable Urban Development ": "Did you know that cities take up less than 3% of the earth’s land surface, but more than 50% of the world’s population live in...",
 "  Science, Technology, and Society in China I: Basic Concepts ": "What is science? What is technology? How do science and technology inform developments in the social sphere? How are science a...",
 "  Community Change in Public Health ": "This course examines the community context of the changes needed to promote the public's health.",
 "  Enhance Your Career and Employability Skills ": "Learn how to make effective decisions about your future career and how to take control your professional development by honing...",
 "  Emergence of Life ": "How did life emerge on Earth? How have life and Earth co-evolved through geological time? Is life elsewhere in the universe? Take a look through the 4-billion-ye...",
 "  Taxes and taxation in Russia ": "This course is a master level program aimed at providing a fundamental understanding of the underlying framework, basic princi...",
 "  Think. Create. Code ": "In this course, you will not only learn the inner workings of your digital world, but also create and manipulate images with code, creating new artworks and inte...",
 "  Introduction to Physical Chemistry ": "Gain a rigorous introduction to physical chemistry suitable for undergraduates starting university. The course provides a unique, in-depth introduction to the th...",
 "  ContractsX: From Trust to Promise to Contract ": "Contracts are promises that the law will enforce. But when will the law refuse to honor a promise? What happens when one party...",
 "  Preparing for the AP* Biology Exam – Part 5: Review and Exam Preparation ": "Preparing for the AP Biology exam requires a deep understanding of many different topics in biology as well as an understandin...",
 "Architecture 101 - Part III ": "From space to architecture: To structure, order and transform space into architecture.",
 "  Energy, the Environment, and Our Future ": "Get Rich and Save the Earth…Or Else! Learn about the past, present, and possible futures of human energy use.",
 "  Jesus in Scripture and Tradition ": "The Bible says that Jesus was identified  as God's beloved son at his baptism. The same identification was made about Israel i...",
 "  Developmental Biology ": "Survey of the field of developmental biology from its origins to the present day, from seminal historical experiments to modern techniques and the mechanisms of ...",
 "  From International Relations to Global Politics ": "From the theories of International Relations to the practice of global politics. To grasp the rule of the global political gam...",
 "  Physics 1 for Physical Science Majors ": "Coming in Fall 2013: This is the first semester of a 2-semester introductory physics sequence taught at the University of Colorado at Boulder. The course is inte...",
 "  Beauty, Form & Function: An Exploration of Symmetry ": "Students will learn how to identify symmetrical forms and appreciate their importance in nature, art, architecture, crystallography and technology. By completing...",
 "  Decouvrir la science politique ": "Décoder des enjeux politiques actuels à partir d’une boîte à outils de concepts fondamentaux et de postures critiques de la science politique.",
 "  Microeconomics Principles ": "Introduction to the functions of individual decision-makers, both consumers and producers, within the larger economic system. Primary emphasis on the nature and ...",
 "  Success - Unleash yourself ": "This nine-week course helps you to improve the rate of success in your life, using theory, individual- and group assignments. ...",
 "  An Introduction to Credit Risk Management ": "What is credit risk? Why is it so important, in modern economies, to correctly deal with it? This course combines theory with ...",
 "  Applied Regression Analysis ": "Regression modeling is the standard method for analysis of continuousresponse data. This course provides theoretical and practical training in statisticalmodelin...",
 "  History of Rock, Part One ": "Learn about the early days of rock music, from the pre-rock years of the post World War II era through the birth of rock in the mid 1950s to the Psychedelic era ...",
 "  Technology Commercialization, Part 1: Setting up your Idea Filtering System ": "New ideas based on high-technology research have a high failure rate because they hit the ground running with lopsided priorit...",
 "  Teaching with Davidson Next ": "Teaching with Davidson Next explains the purpose and mission of Davidson Next: to help improve teaching and learning in AP cou...",
 "  Ageing Well: Falls ": "Explore why people fall, discover practical methods to reduce the risk of falling and recognise when to seek expert help.",
 "  The Law of the European Union: An Introduction ": "The EU is the most successful supranational legal order to which 27 Member Statses have transferred sovereign rights. This cou...",
 "  Economics of Money and Banking, Part Two ": "Introduction to a “money view” of economic activity for modern times, building on the intellectual traditions of British central banking and American institution...",
 "  Genius. Talent. Golden Mediocrity ": "Genius, talent and golden mediocrity are different dimensions of human existence. Our course shows how these three dimensions manifest themselves in life and how...",
 "  Financial Analysis and Decision Making ": "This course will help you understand how businesses create value, how to think with financials in mind and how to use financial information in business decision-...",
 "  Dairy Production and Management ": "With the world's first MOOOOO-C, you will gain a broad and comprehensive understanding of all aspects of dairy management such...",
 "  Public Economics ": "This course deals with the economic role of the state and explores factors that affect government performance. Both normative ...",
 "  Electronic Interfaces: Bridging the Physical and Digital Worlds ": "EE40LX teaches the fundamentals for engineering electronic interfaces between the physical world and digital devices. Students can expect to cover the material o...",
 "  The Science of Medicines ": "Learn the science behind how and why medicines work, and what can improve patient's treatment, with this free online course.",
 "  Computer Science 101 ": "CS101 teaches the essential ideas of Computer Science for a zero-prior-experience audience. The course uses small coding experiments in the browser to play with ...",
 "  Critical Thinking in Global Challenges ": "In this course you will develop and enhance your ability to think critically, assess information and develop reasoned arguments in the context of the global chal...",
 "  The Violent Universe ": "This course will introduce you to the deadliest and most mysterious parts of our universe. Black holes, which warp the very fabric of space-time around them. Whi...",
 "  Serious Game Design and Development ": "Did you know that games can be serious? Serious Games take advantage of the engaging characteristics of games to develop the p...",
 "  Master Control in Supply Chain Management and Logistics ": "Logistics and supply chain structures can be found in virtually any system. A supply chain is a complex environment with a multitude of forces and variables with...",
 "  How Music Works ": "How Music Works is an exploration of the mechanics of musical composition and expression, examining the internal workings of music to uncover how and why music i...",
 "  Evaluating Social Programs ": "JPAL101x will provide a thorough understanding of how randomized evaluations can be used to evaluate social and development pr...",
 "  Non-ferrous Extractive Metallurgy ": "The course will discuss the theoretical and practical aspects of extraction of nonferrous metals. Starting with a brief survey of the early trends in metal extra...",
 "Planet Earth ": "Planet Earth, an overview of geology, discusses how earthquakes, volcanoes, mountain building, floods, ice ages, evolution, climate, and plate tectonics have int...",
 "  Hardware Security ": "In this course, we will study security and trust from the hardware perspective. Upon completing the course, students will unde...",
 "  The Art of Teaching ": "Teaching has always been more of a vocation than a profession. Every responsible citizen of the world was once moulded by a good teacher. It takes a special skil...",
 "  Fundamentals of Digital Image and Video Processing ": "In this class you will learn the basic principles and tools used to process images and videos, and how to apply them in solving practical problems of commercial ...",
 "  Technology and Ethics ": "The meteoric rise of technologies used in our everyday life for profit, power, or improvement of an individual's life can, on ...",
 "  Securing Digital Democracy ": "In this course, you'll learn what every citizen should know about the security risks--and future potential — of electronic vot...",
 "  Foundational Neuroscience for Perception and Action ": "Learn the basic structure and function of the human nervous system, how nerve cells generate electrical signals and communicate, how they reshape their connectio...",
 "AP® Psychology - Course 6: Exam Preparation & Review ": "This course will help you prepare for and improve your performance on the AP® Psychology exam. It includes a review of evidenc...",
 "  The Challenges of Global Health ": "An introduction to key challenges and concepts important to understanding the current status and determinants of global health.",
 "  Calculus: Single Variable ": "This course provides a brisk, entertaining treatment of differential and integral calculus, with an emphasis on conceptual understanding and applications to the ...",
 "  Constitutional Struggles in the Muslim World ": "Learn what motivates the restive Muslim youth from Tunis to Tehran, what political positions Islamists from Mali to Chechnya a...",
 "  The Kennedy Half Century ": "Learn how John F. Kennedy's life, presidential administration, and tragic death have influenced the general public, the media,...",
 "  Financial Markets ": "An overview of the ideas, methods, and institutions that permit human society to manage risks and foster enterprise.",
 "  Practicing Tolerance in a Religious Society: The Church and the Jews in Italy ": "What social and ideological mechanisms allowed Jews to survive and even flourish in Catholic Italy? And under what circumstanc...",
 "  Caries Management by Risk Assessment (CAMBRA) ": "This course will provide the scientific basis for caries (dental decay) risk assessment and practice interventions. You will immediately be able to apply â€œcar...",
 "  The Search for Vernacular Architecture of Asia, Part 1 ": "Join us in the Search for Vernacular Architecture of Asia and learn key concepts to better understand your own local built env...",
 "  Industrial and Organizational Psychology ": "This course will introduce you to the major concepts of and debates surrounding industrial and organizational psychology. Industrial and organizational psycholog...",
 "  Feeding the World ": "Over the next 40 years, food production must double to meet the growing needs of the world population, which is estimated to e...",
 "  Making Sense of News ": "This five-week course will help you identify reliable information in news reports and become better informed about the world w...",
 "  Science, Technology, and Society in China II: History of S&T in Chinese Society ": "This course is the second in a trilogy of short courses. In this part, we apply some of the concepts we covered in Part I to s...",
 "  Financing and Investing in Infrastructure ": "Learn how debt and equity can be used to finance infrastructure investments and how investors approach infrastructure investme...",
 "  Planning & Design of Sanitation Systems and Technologies ": "Learn more about how to plan for urban sanitation at city and local/community levels, different sanitation system and technolo...",
 "  Design: Creation of Artifacts in Society ": "Combine fundamental concepts with hands-on design challenges to become a better designer.",
 "  Advanced Mathematical Techniques in Chemical Engineering ": "Introduction of vector space;Metric, Norm, Inner Product space;Examples Onto, into, one to one function, completeness of space, Vectors: Linear combination of ve...",
 "  Care of Elders with Alzheimer's Disease and other Major Neurocognitive Disorders ": "This is a Statse-of-the-art course designed to accommodate the learning needs of health professionals related to dementia care...",
 "  Probability and Statistics ": "Algebra of sets, introduction to probability, random variables, probability distributions, moments, moment generating function, Markov and Chebyshev inequalities...",
 "  The Science of Everyday Thinking ": "Learn how to think better, argue better, and choose better.",
 "  Preparing for the AP* Physics 2 Exam – Part 4: Exam Review ": "Preparing for the AP Physics 2 exam requires a deep understanding of many different topics in physics as well as an understand...",
 "  Preparing for the AP* English Language and Composition Exam ": "This course is designed to help students become skilled readers and writers through engagement with the following course requi...",
 "  Supply Chain and Logistics Fundamentals ": "SC1x is an introduction to the fundamental concepts for logistics and supply chain management from both analytical and practic...",
 "  Chinese Thought: Ancient Wisdom Meets Modern Science - Part 2 ": "This course is designed to give students a thorough introduction to early (pre-221 BCE) Chinese thought, its contemporary impl...",
 "  Introduction to Dynamical Systems and Chaos ": "In this course you'll gain an introduction to the modern study of dynamical systems, the interdisciplinary field of applied mathematics that studies systems that...",
 "  Design in Healthcare: Using Patient Journey Mapping ": "In this course you will learn about the different experiences patients go through in a medical context. The patient journey explores the interaction between the ...",
 "  Explaining European Paintings, 1400 to 1800 ": "The Meaning Behind the Art of Caravaggio, Rembrandt, Goya and many more.",
 "  Fairness and nature: When worlds collide ": "Making decisions about managing natural resources can be difficult; this course explores why fairness needs to be part of policy.",
 "  Food, Nutrition & Your Health ": "Walk through the basics of nutrition, how eating disorders develop, and learn the benefits of various diets.",
 "  Fixing Healthcare Delivery ": "Isn't it time to end the loss of life from preventable medical errors? Each year 100,000 patients die from preventable errors in the U.S. How can you help to ch...",
 "  Statistics for Business – I ": "Statistics is a versatile discipline that has revolutionized the fields of business, engineering, medicine and pure sciences. This course is Part 1 of a 4-part s...",
 "  Fundamentals of Human Nutrition ": "This introductory course provides an overview of the principles of nutritional science. Subject matter includes description and functions of nutrients, digestion...",
 "  Metadata: Organizing and Discovering Information ": "Metadata is an unsung hero of the modern world, the plumbing that makes the information age possible. This course describes ho...",
 "  Probability ": "How should we interpret chance around us? Watch beautiful mathematical ideas emerge in a glorious historical tapestry as we discover key concepts in probability...",
 "  Marine Construction and Welding ": "Introduction to ships & offshore structures; Characteristics of shipbuilding industry; Structural Requirement - Longitudinal strength, Transverse strength,Torsio...",
 "  Management Information Systems ": "Survey that covers the various components of business information systems, with particular emphasis on the means by which information is transmitted, the softwar...",
 "  Information Security and Risk Management in Context ": "Learn to defend and protect vital company information using the latest technology and defense strategies. Analyze internal and...",
 "  Intermediate Microeconomics ": "Rigorous introduction to resource allocation in a market economy, with particular emphasis on supply and demand interaction, utility maximization, profit maximiz...",
 "  Critical Thinking - Reason and Fair Play in Communication ": "A fun journey through the mechanism of reasoning and argumentation, illustrated by tons of documented experiments and interesting examples.",
 "  Sustainable Mobility ": "After successfully completing this course, participants will be able to: Identify the different energies sources, the...",
 "AIDS ": "This course will discuss HIV/AIDS in the US and around the world including its history, science, and culture as well as recent...",
 "  Special Theory of Relativity ": "This is a half a semester (20 Lecture) course on Special Theory of Relativity, which revolutionized our concept of physics in the last century by unifying concep...",
 "  The Psychology of Criminal Justice ": "Learn how behavioural science can improve our criminal justice system.",
 "  General Chemistry I ": "Detailed introduction to the basic principles and methods of chemistry, which are the foundation to all subsequent chemistry courses. Surveys the metric system, ...",
 "Cardiac Arrest, Hypothermia, and Resuscitation Science ": "This course will explore new breakthroughs in the treatment of patients during cardiac arrest and after successful resuscitation, including new approaches to car...",
 "  Statistics ": "We live in a time of unprecedented access to information. You'll learn how to use statistics to interpret that information and make decisions.",
 "Introduction to Aeronautical Engineering ": "Discover the fascinating world of aviation by investigating aeronautics, with a closer look at aerodynamics and flight mechanics.",
 "  Introduction to Probability - The Science of Uncertainty ": "The world is full of uncertainty: accidents, storms, unruly financial markets, noisy communications. The world is also full of data. Probabilistic modeling and t...",
 "Art Appreciation and Techniques ": "Introductory course that explores what defines art, how to describe works of art, different types of media and how they are made, and provides a basic survey of ...",
 "  Principles of Public Health ": "Principles of Public Health introduces the major concepts and principles of public health and the determinants of health status in communities. Emphasizes the ec...",
 "  Understanding Drugs and Addiction ": "How do addictions develop? How are they best treated and prevented? Explore these key questions with this free online course.",
 "  Career Edge: Business and Data Analysis ": "Understanding how to analyze, synthesize and communicate data is increasingly critical in the modern workplace. This course teaches you how to evaluate market an...",
 "  CLEP Information Systems and Computer Applications, Part 5: Social Implications ": "This is the fifth part of an introductory  business information systems series, designed to help you pass the CLEP Information Systems and Computer Applications ...",
 "  Interactive Computer Graphics ": "This course introduces various interactive tools for visual problem solving. Students will learn how to design and implement s...",
 "  Introduction to Biomaterials ": "Introduction to basic concepts of Materials Science; Salient properties of important material classes; Property requirement of biomaterials; Concept of biocompat...",
 "  Intro to the Design of Everyday Things ": "This course will provide you with the insight to start recognizing the role of design in today’s world, and to start making better design decisions in your own l...",
 "  Gut Check: Exploring Your Microbiome ": "Imagine if there were an organ in your body that weighed as much as your brain, that affected your health, your weight, and ev...",
 "  Managing My Money ": "Gain the skills to manage your personal finances: managing budgets, debts, investments, property purchase, pensions and insura...",
 "  Unethical Decision Making in Organizations ": "This course 'Unethical decision making in organizations : A seminar on the dark side of the force' will teach you how strong o...",
 "  Buddhist Art ": "Introduction to the Buddhist artistic traditions of South, Southeast, and East Asia. This course highlights the interaction be...",
 "  Global Perspectives on Sexual and Reproductive Health and Rights (SRHR) ": "Questions related to sexuality and reproduction are intimately linked to health, well-being and human rights. In this course, ...",
 "  Natural Disasters ": "This course examines the science behind different types of natural disasters and our ability or inability to control and predi...",
 "  Money and Banking / Financial Economics ": "Detailed study of the importance of money, banking, and financial markets and institutions of a developed economy, with particular attention to foreign exchange ...",
 "  Introduction to Financial and Management Accounting ": "Start learning towards a qualification and a career in business and finance with this introduction level course.",
 "  Computer Systems Design for Energy Efficiency ": "In order to be competitive in the computer science field, it’s imperative to understand the basic building blocks of a modern computer and how they directly impa...",
 "  Fundamentals of Audio and Music Engineering: Part 1 Musical Sound & Electronics ": "In this course students learn the basic concepts of acoustics and electronics and how they can applied to understand musical s...",
 "Preparing for the AP* Physics 2 Exam – Part 1: Fluids and Thermodynamics ": "Preparing for the AP Physics 2 exam requires a deep understanding of many different topics in physics as well as an understand...",
 "  The Science of Gastronomy ": "This course introduces students to elements of science lying behind cooking and cuisine preparation. The ultimate goal is to h...",
 "  Seakeeping & Manoeuvring ": "Regular water waves – definition of ship motions – single degree of freedom motions in regular waves – uncoupled heave, pitch and roll motions – coupled heave an...",
 "  Global Health Cultures ": "Using the work of scientists, anthropologists, and scholars of the medical humanities, we explore new ways of thinking about global health and culture as global ...",
 "  The Finance of Retirement & Pensions ": "This eight-week course focuses on the financial concepts behind sound retirement plan investment and pension fund management. Course participants will become mor...",
 "  Major Depression in the Population: A Public Health Approach ": "Illustrates the principles of public health applied to depressive disorder, including principles of epidemiology, transcultural psychiatry, health services resea...",
 "  Human Factors and Culture in Design ": "In our daily life, various products and service have brought us many rich and colorful user experiences as well as shown some ...",
 "  Environmental Studies: A Global Perspective ": "This environmental studies course is intended to introduce you to some of the basic principles in environmental studies, and how those are manifested in urban, r...",
 "  Childhood in the Digital Age ": "Delve into the lives of children and discuss the potential benefits and limitations of technology in their lives.",
 "  Marketing Fundamentals: Who Is Your Customer? ": "In order to compete in an ever-changing market, business leaders must assess and respond to consumer needs and wants. Marketing is a means of creating value for ...",
 "  Dynamic Systems & Controls ": "Exploration of the behavior of physical systems as well as the physics of individual components and the interactions between them. Topics include: modeling dynam...",
 "  Drugs and the Brain ": "The neuroscience of drugs for therapy, for prevention, and for recreation. You'll learn the prospects for new generations of m...",
 "  Paradigms of Computer Programming ": "This course covers functional, object-oriented, and declarative dataflow programming in a unified framework, with practical code fragments and a simple semantics...",
 "  Supply Chain Dynamics ": "Supply Chains are complex systems involving multiple firms and organizations with different goals and objectives. Additionally, there are external forces and tr...",
 "  Sports and Recreation Management ": "Discover the careers in sports and recreation and learn to deliver a simple client-focused session.",
 "  Introductory Physics I with Laboratory ": "Explore motion in the real world using modern tools and techniques (video capture and analysis, computer modeling) guided by fundamental physics principles.",
 "  Medicines Adherence: Supporting Patients with their Treatment ": "How can healthcare professionals help patients to improve their health through medicines adherence?",
 "  Astrobiology and the Search for Extraterrestrial Life ": "Learn about the origin and evolution of life and the search for life beyond the Earth.",
 "  Introduction to Chemistry: Reactions and Ratios ": "This is an introductory course for students with limited background in chemistry; basic concepts involved in chemical compositions, periodic trends, reactions, a...",
 "  Shakespeare ": "Detailed study of Shakespeare’s life, literary works, historical and philosophical contexts, and a close examination of his poetry and six of his major plays: A ...",
 "  Introduction to Art: Concepts & Techniques ": "Learn to identify and define various art movements, artists, and their artworks. Convey a personal appreciation for art concepts, techniques, and approaches thro...",
 "  English Composition I: Achieving Expertise ": "You will gain a foundation for college-level writing valuable for nearly any field. Students will learn how to read carefully, write effective arguments, underst...",
 "  Operations Management ": "Recognize the role of operations within the bigger picture of business strategy and master the fundamental aspects of managing...",
 "  Engineering Life: Synbio, Bioethics & Public Policy ": "Learn about the ethics and policy issues that arise in the science and application of synthetic biology, from bioremediation t...",
 "  Work Smarter, Not Harder: Time Management for Personal & Professional Productivity ": "You will be able to gain and apply your knowledge and understanding of personal and professional awareness, organization and commitment, and use the tools, metho...",
 "  Introduction to Aerodynamics ": "Discover the basic fluid dynamic concepts behind aircraft analysis and design.",
 "  Digital Marketing Channels: Planning ": "Discover the multiple channels used by digital marketers today and how to leverage them optimally. Interact with content and hear from industry experts invited t...",
 "  Introduction to Politics ": "Introductory survey on the basic principles, terminology, and methods of political science. Combines historical study of the discipline’s greatest thinkers with ...",
 "  Regression Models ": "Learn how to use regression models, the most important statistical analysis tool in the data scientist's toolkit. This is the ...",
 "  Epidemics - the Dynamics of Infectious Diseases ": "Malaria, HIV/AIDS, Influenza, Measles - we're in a constant battle against infectious diseases. This is a course about the dyn...",
 "Introduction to Mechanical Engineering ": "Introductory survey of the various types of engineering, with particular emphasis on mathematics and physics important in engineering, technical drawing, numeric...",
 "  Clinical Terminology for International Students ": "This course provides strategies for learning U.S. clinical language, guidance on cultural issues, and a special reference for students who are planning to or hav...",
 "  Caring for Vulnerable Children ": "Develop an understanding of some of the approaches involved in caring for vulnerable children, with this free online course.",
 "  Medical Neuroscience ": "Explore the structure and function of the human central nervous system. Learn why knowledge of human neuroanatomy, neurophysiology, neural plasticity, and new di...",
 "  Population and Society ": "This course proposes to discuss the relationship between social processes and demographic transition in India. Therefore, it ...",
 "  Healthcare Data Visualization ": "An overview to the state of the art of interactive data visualization in healthcare. The course will cover data visualization principles, methods, and techniques...",
 "  Qualitative Research Methods ": "Learn about the qualitative approach to the social and behavioral sciences, using qualitative methods of inquiry and analysis....",
 "  The Beauty and Joy of Computing (CS Principles), Part 2 ": "The Beauty and Joy of Computing (BJC) (2of 4) is a computer science principles course developed at the University of California, Berkeley, intended to broaden pa...",
 "  Introduction to User Interface Design (Part 1) ": "This course is an introduction to the area of Human Computer Interaction.  It shows students the first two steps in the design...",
 "  An Introduction to Financial Accounting ": "This course will improve your fluency in financial accounting, the language of business. You will learn how to read, understand, and analyze most of the informa...",
 "  United States History 1 ": "Introduction to the political, economic, social, and cultural history of the United States of America from the first contact b...",
 "  The Diversity of Exoplanets ": "The course will provide an overview of the knowledge acquired during the past 20 years in the domain of exoplanets. It will review the different detection method...",
 "  Shakespeare: On the Page and in Performance ": "An introduction to Shakespeare that combines literary study with theatrical analysis to understand both Shakespeare’s continuing popularity and his greatness.",
 "  Property and Liability: An Introduction to Law and Economics ": "Think about the oldest and most familiar principles of American law, property and proportional liability, in a new and surprising way, and learn to apply economi...",
 "  Natural Dyes ": "Extraction of plant part for isolation of colorant, its separation by different chromatographic technique, spectroscopic analysis of the isolated colorant, struc...",
 "  Medicating for Mental Health: Judicious Use of Psychiatric Drugs ": "This course prepares you to be an effective collaborator with your physician, psychiatrist, or psychologist when deciding if a...",
 "  Cell Biology ": "Detailed exploration of the cell and its structures, including molecular compounds, structural features, and organelles including the nucleus, cytoskeleton, and ...",
 "  Photography: A Victorian Sensation ": "Explore the Victorian craze for photography, examine its history, from the earliest images in 1839 and how it has influenced t...",
 "  Innovation for Entrepreneurs: From Idea to Marketplace ": "Develop insights on navigating the innovation process from idea generation to commercialization. Build knowledge on how to cre...",
 "  Responding to 9/11 ": "9/11 was a devastating attack that required a comprehensive response from the United States. This course will examine post-9/11 U.S. counterterrorism policies re...",
 "  Fluid Mechanics ": "Detailed examination of fluids and their properties, surveying flow regimes, dynamics and kinematics, Reynolds transport theorem, Navier-Stokes equations, dimens...",
 "  Alcohol, Drugs, and Baby Boomers: Are you ready? ": "As the baby boomer generation ages, the impacts of alcohol and drug use among this generation will become an increasingly impo...",
 "  The Beauty and Joy of Computing (CS Principles), Part 1 ": "The Beauty and Joy of Computing (BJC) is a computer science principles course developed at the University of California, Berkeley, intended to broaden participat...",
 "  History of Europe, 1800 to the Present ": "Introductory study to the political, economic, social, religious, and intellectual history of Europe, from the 1800s to the pr...",
 "  Intro to Statistics ": "Statistics is about extracting meaning from data. In this class, we will introduce techniques for visualizing relationships in data and systematic techniques for...",
 "  What future for education? ": "Everyone has experienced education as a learner: these experiences shape how we view and value education, and how we think it should develop in the future. In th...",
 "  Inorganic Chemistry ": "Study of the chemistry, properties, and reactivity of metal-containing compounds. Topics include: atomic structure and electron configurations, bonding theories,...",
 "  Antimicrobial Stewardship: Managing Antibiotic Resistance ": "Understand antimicrobial resistance and how antimicrobial stewardship can slow down or reduce its occurrence.",
 "  US Voting Access and Fraud ": "As the US general election approaches, there is a firestorm of rhetoric around access and fraud. Major legislation changes, court rulings and political views con...",
 "  Data Management for Clinical Research ": "Learn critical concepts and practical methods to support research data planning, collection, storage and dissemination.",
 "  Introduction to International Criminal Law ": "Taught by one of the world's leading experts in the field, this course will educate students about the fundamentals of interna...",
 "  Psychotechnology and learning processes ": "Course main objective is to show how psychotecnologies impact on cognitive processes, extend mind potential and modify interaction models among people coming fro...",
 "  Global Postharvest Loss Prevention: Fundamentals, Technologies, and Actors ": "This course provides an overview of the issue of postharvest loss of grains by exploring essential physical, technical, and social dimensions of postharvest supp...",
 "  Introduction to Mechanics ": "A basic introduction to the current physical understanding of our universe, from an examination of basic principles of physical law, their application to the beh...",
 "  Gender and Sexuality ": "Detailed introduction to the study of the different ways our gender roles and sexual identities impact our lives, including how our own gender and sex can affect...",
 "  The Music of the Beatles ": "The Music of the Beatles will track the musical development of the band, starting from the earliest days in Liverpool and Hamburg, moving through the excitement ...",
 "Italian Language and Culture: Beginner ": "In this language course you will learn the four basic skills (speaking, listening, reading and writing) in the context of majo...",
 "  AP® Calculus: Challenging Concepts from Calculus AB & Calculus BC ": "Well-respected AP instructors from around the United States will lead you through video instruction, exam-style questions and ...",
 "Applying to U.S. Universities ": "This course will help you understand how the U.S. university application and admission process works for international student...",
 "  Introduction to Classical Music ": "Using a simple and enjoyable teaching style, this course introduces the novice listener to the wonders of classical music, from Bach fugues to Mozart symphonies ...",
 "  Biomathematics ": "Graphs and functions, Derivative of a function, Techniques of differentiation Differentiation and its application in Biology, Finding maxima, minima, Plotting fu...",
 "  Spectroscopy ": "Detailed introduction of the theory, instrumentation, application of spectroscopic techniques. Topics include: mass spectrometry, ultraviolet-visible (UV-Vis) sp...",
 "  Introduction to Genetics and Evolution ": "A whirlwind introduction to evolution and genetics, from basic principles to current applications, including how disease genes...",
 "  Hospitality and Tourism in China: A Global Perspective ": "This course explores present and future development and trends in the tourism and hospitality business in China. It introduces...",
 "Introduction to Pharmacy ": "This course is a survey of the profession of pharmacy including its history, evolving scope of practice, ethical foundations, regulation, educational and career ...",
 "  Introduction to Film Studies ": "The objective of this course is to enable students to understand the language of cinema and to help them recognize significant film movements and theories as we...",
 "  Principles of Finance ": "Study of a number of different sub-fields within finance, with particular emphasis on determining which projects have the best potential payoff, managing investm...",
 "  Energy 101 ": "This multidisciplinary course will give students an overview of energy technologies, fuels, environmental impacts and public p...",
 "  Engaging India ": "A course that examines some of the factors that have shaped India and what makes India the country it is today.",
 "  Early Globalizations ": "Introductory survey to the major civilizations from the Middle Ages to the Early Modern Era, focusing on the political, social...",
 "  Forensic Psychology: Witness Investigation ": "Discover how psychology can help obtain evidence from eyewitnesses in police investigations and prevent miscarriages of justic...",
 "Our Earth: Its Climate, History, and Processes ": "Develop a greater appreciation for how the air, water, land, and life formed and have interacted over the last 4.5 billion years.",
 "  Miracles of Human Language: An Introduction to Linguistics ": "Everywhere, every day, everybody uses language. There is no human society, no matter how small or how isolated, which does not employ a language that is rich and...",
 "  Introduction to Light, Color, and Life ": "To share knowledge and issues in the physical properties of light, the accommodation of light in biological phenomena and medi...",
 "  The World of the String Quartet ": "Arnold Steinhardt, first violin of the internationally acclaimed Guarneri String Quartet, invites music listeners to the world of the string quartet repertoire a...",
 "  Science & Cooking: From Haute Cuisine to Soft Matter Science ": "Top chefs and Harvard researchers explore how everyday cooking and haute cuisine can illuminate basic principles in physics an...",
 "  The Science of the Solar System ": "Explore the solar system using concepts from physics, chemistry, biology, and geology. Learn the latest from Mars, explore the...",
 "  Introduction to International Relations ": "Introduction to the fundamental principles of international relations within the political science framework, exploring issues...",
 "  The Beauty and Joy of Computing (CS Principles), Part 3 ": "This course teaches students how to do exactly that, using Snap! (based on Scratch), one of the friendliest programming languages ever invented. It's purely grap...",
 "  Advanced Organic Chemistry ": "Detailed examination of organic chemistry, with particular emphasis on ylides, benzynes, free radicals, stereochemistry, reaction mechanisms and kinetics, organo...",
 "  Leaders of Learning ": "All of us carry explicit or implicit theories of learning. They manifest themselves in the ways we learn, the ways we teach, and the ways we think about leadersh...",
 "  Networking Leadership 101: Building Your Core Professional Network ": "This +Acumen On Demand course is focused on networking for change makers. In this 2.5 short course, you'll learn to diagnose ...",
 "  First-Year Composition 2.0 ": "First-Year Composition 2.0 will help you to develop a better process and gain confidence in written, visual, and oral communication and to create and critique co...",
 "  Take the Lead on Healthcare Quality Improvement ": "This course presents the concepts and processes of quality improvement (QI) and the importance of QI in improving patient outcomes. Its aim is to enhance the co...",
 "  Sexing the Canvas: Art and Gender ": "What do paintings tell us about sex? How is art gendered? Here we get up close to some of the great paintings in the worldÍs m...",
 "  Managerial Accounting: Cost Behaviors, Systems, and Analysis ": "The focus of managerial accounting is to provide key information to internal parties (e.g., managers) to enable them to make better business decisions. This cour...",
 "  Cultural Geography of the World ": "This course teaches an approach to spatial patterns and changing process of cultures through geographical perspectives. (Taugh...",
 "  The Power of Markets ": "The course will give you the tools with which to understand and predict market phenomena. A large dose of real-world applications will be provided along the way....",
 "  Preparing for the AP* Statistics Exam ": "This course will introduce students to the major concepts and tools for collecting, analyzing and drawing conclusions from dat...",
 "  Respiration in the Human Body ": "How do we breathe? What is the purpose of our lungs? What is the link between oxygen and life ? These questions open a vast fi...",
 "  Global Health: Case Studies from a Biosocial Perspective ": "Reimagine global health problems with some of the leading global health thinkers and actors through a case-based biosocial framework.",
 "  Mechatronics ": "Most mechanical engineering systems today involve significant amounts of electrical and electronic control systems. Effectively, most modern mechanical engineeri...",
 "  Graphene and 2-dimensional Materials ": "Gain a foundational understanding of the world of 2-dimensional materials, including Graphene. This course provides an overview of this exciting new field of stu...",
 "  Synapses, Neurons and Brains ": "You will become intimately acquainted with the operational principles of the neuronal “life-ware” - synapses, neurons and the networks that they form, and with r...",
 "  Computational Neuroscience ": "Understanding how the brain works is one of the fundamental challenges in science today. This course will introduce you to basic computational techniques for ana...",
 "  Genomic Medicine Gets Personal ": "This course will provide an introduction to genomic medicine and a better understanding of the issues associated with personal...",
 "  History of the Slave South ": "This course explores the relationship between slavery and democracy at the heart of American history. It is about the rise an...",
 "  Valuing Projects and Companies ": "This course is a theoretically sound and practical exposure to valuation. As the final course of the Specialization, it will be useful to anyone in understanding...",
 "  Global Health and Humanitarianism ": "Is humanitarianism an effective, justifiable and sustainable response to ill-health, inequality, injustice and war?",
 "  Entrepreneurship 102: What can you do for your customer? ": "Ask not what your customer can do for you – ask what you can do for your customer.  In Entrepreneurship 101, you’ve learned t...",
 "  Human Rights: The Right to Freedom of Expression ": "Freedom of expression is a human right. Learn from the experts at Amnesty International how to claim and defend your rights in...",
 "  Entrepreneurship 101: Who is your customer? ": "You have an idea for a product, but do you know who will want to buy it?",
 "  Interprofessional Healthcare Informatics ": "This course examines the implications of informatics for practice, in nursing, public health, and healthcare in general. It co...",
 "  Sense, Control, Act: Measure the Universe, Transform the World ": "This course explores the basis of electronic sensing of our world and how we then use these measures to change it.",
 "  Electricity & Magnetism, Part 2 ": "PHYS 102x serves as an introduction to electricity and magnetism, following the standard second semester college physics sequence. Part 2 begins with the nature ...",
 "  Calculus 1C: Coordinate Systems & Infinite Series ": "How did Newton describe the orbits of the planets? To do this, he created calculus.  But he used a different coordinate system more appropriate for planetary mot...",
 "  Introduction to Environmental Science ": "Environmental science is the study of patterns and processes in the natural world and their modification by human activity.  To understand current environmental ...",
 "  Bases Matemáticas: Álgebra ": "En este curso se recordará lo que es una ecuación  con una única incógnita y cómo solucionarla. A partir de ahí se tratarán: Los sistemas de ecuaciones lineales...",
 "  Elements of Structures ": "A first course on statics and on the mechanical behavior of structural elements.",
 "  Introduction to Human Evolution ": "An overview of human evolutionary history viewed through the human fossil, archaeological and genetic records.",
 "  The Data Scientist’s Toolbox ": "Get an overview of the data, questions, and tools that data analysts and data scientists work with. This is the first course i...",
 "  Existentialism ": "In this course, you will explore the major figures and works of the existentialist movement from a historical perspective. You will study, in sequence, the works...",
 "  Engineering Systems in Motion: Dynamics of Particles and Bodies in 2D Motion ": "This course is an exciting look at the study of rigid bodies in motion (dynamics) as applied to engineering systems and structures.",
 "  The Impact of Nursing ": "Take a journey from the past to the future of nursing with this free online course. Explore nursing’s impact on quality of life.",
 "  Learning for Sustainability: Developing a personal ethic ": "We all have our own understandings of ‘sustainability', of its significance as an environmental, social, economic and moral concept, and as a principle for indiv...",
 "  Genetics and Society: A Course for Educators ": "How have advances in genetics affected society? What do we need to know to make ethical decisions about genetic technologies? ...",
 "  Statistics for Genomic Data Science ": "An introduction to the statistics behind the most popular genomic data science projects. This is the sixth course in the Genom...",
 "  Food for Thought ": "A course that offers a scientific framework for understanding food and its impact on health and society from past to present.",
 "  History of Chinese Architecture ": "China's architectural history spans thousands of years. In this course, we will explore the ancient cities of Chang'an of Han...",
 "  Internet History, Technology, and Security ": "What is the Internet? How was it created? How does it work?",
 "  Mastering Quantum Mechanics ": "A course that develops the tools and the mathematical foundation needed to have a working knowledge of Quantum Mechanics.",
 "  The Olympic Games and the Media ": "This course analyzes the intersection between the Olympic Games and the media and how television and other media contribute to...",
 "Chinese for Beginners ": "Nowadays, there is an increasing number of people who are interested in Chinese culture and language. And it is useful to know...",
 "  Introduction to Logic ": "In this course, you will learn how to formalize information and reason systematically to produce logical conclusions. We will ...",
 "  Developing Innovative Ideas for New Companies ": "Explore how to identify and develop great ideas into great companies. Learn how to identify opportunities based on real customer needs. Develop solid business mo...",
 "  Introduction to Systematic Review and Meta-Analysis ": "Learn to assess data from clinical trials by performing systematic reviews and meta-analyses.",
 "  Early Christian and Byzantine Art ": "Detailed examination of the history of Eastern (Orthodox) Christian art from the emergence of Christianity in the Late Antique...",
 "  Financial Evaluation and Strategy: Investments ": "Learn the fundamental principles of trading off risk and return, portfolio optimization, and security pricingâ€”useful skills ...",
 "  Fundamentals of Combustion ": "Introduction to combustion, Applications of combustion, Types of fuel and oxidizers, Characterization of fuel, Various combustion mode, Scope of combustion.",
 "  Introduction to Aerospace Propulsion ": "The making of thrust to fly - science and history of propulsion; How the jet engines make thrust : conceptual basis; Jet engine : Turbo-jet, Turbo-fans, Turbo p...",
 "  Behavioral Economics in Action ": "How can we get people to save more money, eat healthy foods, engage in healthy behaviors, and make better choices in general? There has been a lot written about ...",
 "  Our Energy Future ": "This course is all about energy: what it is, how it is produced, the positive and negative effects, and renewable energy techn...",
 "  Climate change: challenges and solutions ": "This course aims to explain the science of climate change, the risks it poses, and the solutions available to reduce those ris...",
 "  Discover dentistry ": "An entertaining and illuminating course for everyone to explore the impact dentistry has on our lives.",
 "  How to Read Your Boss ": "How can we talk more effectively in the workplace? This course introduces linguistic techniques to enhance business communication.",
 "  MyCS: Computer Science for Beginners ": "We believe that anyone can succeed in and enjoy computer science. This course is an early introduction to CS, designed for anyone who's completely new to the fie...",
 "  Discovering Business in Society ": "Discover how businesses function and interact with the wider socio-economic environment. In association with ACCA.",
 "  Introduction to Solid State Chemistry ": "3.091x explains chemical principles by examination of the properties of materials.",
 "  Corporate Finance Essentials ": "Corporate Finance Essentials will enable you to understand key financial issues related to companies, investors, and the interaction between them in the capital ...",
 "  Neuronal Dynamics - Computational Neuroscience of Single Neurons ": "The activity of neurons in the brain and the code used by these neurons is described by mathematical neuron models at differen...",
 "  Visual Design ": "A blank canvas is full of possibility. If you have an idea for a user experience, how do you turn it into a beautiful and effe...",
 "  Start Writing Fiction ": "English creative writing course for transition to First Year Undergraduate Bachelor.",
 "  Introduction to Music ": "An introductory survey of the Western classical tradition, with a focus on the development of aural skills that lead to an understanding and appreciation of musi...",
 "  Preparing for the AP* Calculus AB and BC Exams (Part 2 - Integral Calculus) ": "This is a 6 week course covering the second part of AP* Calculus curriculum which includes integration rules, techniques and a...",
 "  Intro to Data Science ": "What does a data scientist do? In this course, we will survey the main topics in data science so you can understand the skills...",
 "  Latin American Culture ": "This course will develop students’ abilities to understand Latin American culture at both the national and regional levels. St...",
 "  Business Models for Social Enterprise ": "This four-module experiential course by +Acumen and the Miller Center for Social Entrepreneurship is a hands-on introduction t...",
 "  Surviving Your Rookie Year of Teaching: 3 Key Ideas & High Leverage Techniques ": "Learn the key ideas and techniques that you need to survive - and thrive - as a rookie teacher.",
 "Introduction to Tissue Engineering ": "Step into the world of Tissue Engineering, a rapidly expanding field of applied biology aiming to create artificial organs for transplantation, basic research, o...",
 "  From the Repertoire: Western Music History through Performance ": "This course will focus on eight important works from the Western classical-music repertoire that represent different eras and genres throughout history. We'll ob...",
 "  Shaping the Future of Work ": "In this course, we’ll trace the history of work and employment that has made the economy work so well in the past. And we’ll u...",
 "Preparing for the AP* Environmental Science Exam - Part 1: The Living World ": "Preparing for the AP Environmental Science exam requires a deep understanding of many different topics in environmental scienc...",
 "  Antimicrobial Stewardship: Optimization of Antibiotic Practices ": "This course will offer a practical approach to prescribing antibiotic therapy and development of antimicrobial stewardship across all specialties and settings. A...",
 "Scandinavian Film and Television ": "In many ways Scandinavian film and television is a global cultural brand, connected with and exporting some of the cultural and social values connected to a libe...",
 "  Survey of Music Technology ": "Learn to make music with digital audio workStatsion software, understand the theory and history behind music production tools, and write your own computer progra...",
 "  Valuation: Alternative Methods ": "This course is a rigorous introduction to alternative methods of valuation and will enable the learner to conduct analysis of most projects and companies. This c...",
 "  Constitutional Law ": "An introduction to the main themes of the American Constitution's popular sovereignty, separation of powers, federalism, and r...",
 "  Future Cities ": "A first course to understand a city’s people, components, functions, scales and dynamics, as precondition for its sustainable ...",
 "  AP® Calculus BC ": "In this calculus course, you will learn all the Calculus BC topics that are not part of the AP® Calculus AB curriculum by enga...",
 "  Cellular Mechanisms of Brain Function ": "The function of the brain is to govern behavior, and the aim of this course is to causally link biophysical mechanisms with si...",
 "  The Architectural Imagination ": "Architecture engages a culture’s deepest social values and expresses them in material, aesthetic form. In this course, you will learn how to “read” architecture ...",
 "  System Design for Supply Chain Management and Logistics ": "Logistics and supply chain structures can be found in virtually any system. In this business and management course you will learn not only what makes leading sys...",
 "  Conversations that Inspire: Coaching Learning, Leadership and Change ": "Coaching can inspire and motivate people to learn, change and be effective leaders, among other roles in life. Although most attempts are “coaching for complianc...",
 "  Mass Transfer Operations I ": "The importance of Mass Transfer operations in chemical processes is insightful. There is scarcely any industrial process that does not require a preliminary puri...",
 "  Research Methods Lab ": "Application of knowledge gained in PSYCH202a, through creation, editing, evaluation and review of experiments.",
 "  DOCUMENTARY! New Trends, New Formats ": "This MOOC presents the new trends and formats of 21st century audio-visual documentary including a brief historical overview. ...",
 "  CLEP Information Systems and Computer Applications, Part 4: Programming ": "This is the fourth part of an introductory business information systems course, designed to help you pass the CLEP Information Systems and Computer Applications ...",
 "Management ": "This Management course provides basic information about main management functions, management prehistory and its theories, basic points of operation, marketing, ...",
 "  Mathematics I ": "The course provides an introduction to the mathematical analysis and linear algebra. The course starts with the real numbers and the related one-variable real fu...",
 "  Networks, Crowds and Markets ": "Explore the critical questions posed by how the social, economic, and technological realms of the modern world interconnect.",
 "  First Year Teaching (Secondary Grades) - Success from the Start ": "Success with your students starts on Day 1. Learn from NTC's 25 years developing key skills and strategies to create positive, productive classroom environments ...",
 "  Marine Hydrodynamics ": "Introduction - ideal and viscous incompressible fluid; Kinematics of fluid; Lagrangian and Eulerian methods of description, velocity, acceleration, streamlines, ...",
 "  Exploring Beethoven's Piano Sonatas ": "A series of lectures on one of the greatest bodies of music ever composed, from the point of view of a performer. Each lecture will explore a different facet of ...",
 "  IMAGE | ABILITY - Visualizing the Unimaginable ": "After finishing this course you will be more skilled in finding the right visual language to convey your ideas, thoughts and vision. You will be able to illustra...",
 "  Logic and Critical Thinking ": "Examination of how to think effectively by investigating critical modes of thinking such as formal and informal logic, meaning...",
 "  Corporate Finance ": "This course is intended to provide a market-oriented framework for analyzing the majortypes of financial decisions made by corporations. Lectures and readings wi...",
 "  The Social Context of Mental Health and Illness ": "Learn about how social factors that promote mental health can influence the onset and course of mental illness, and how mental illnesses are diagnosed and treate...",
 "  Mechanics: Motion, Forces, Energy and Gravity, from Particles to Planets ": "Mechanics is the basis of much of physics, engineering and other technological disciplines. It begins by quantifying motion, and then explaining it in terms of f...",
 "  Public Relations ": "Effective public relations skills are essential to so much of the success in private and public spheres. Public relations efforts address how we wish to present...",
 "  Foundations of Virtual Instruction ": "Learn what it takes to teach a K-12 course online! Investigate the history of virtual education, explore innovative tools, and examine key issues related to K-12...",
 "  The Biology of Water and Health - Sustainable Interventions ": "This water sustainability course (PH242x) from Tufts University focuses on the engineering and public health components needed...",
 "  Intro to Nursing in Healthcare ": "Considering a career in nursing? This subject will introduce you to the role of nurses in Australian healthcare.",
 "  Creativity, Innovation, and Change ": "Explore your unique brand of creativity to gain deeper personal insight. Learn and apply new techniques to make innovative con...",
 "  Wiretaps to Big Data: Privacy and Surveillance in the Age of Interconnection ": "Explore the privacy issues of an interconnected world.",
 "  Introduction to Cataract Surgery ": "This comprehensive course will give you the fundamental knowledge needed to begin performing cataract surgery by phacoemulsifi...",
 "  How to Change the World ": "How can we use the things we share in common to address some of the most challenging problems facing the world? This course ex...",
 "  Social Entrepreneurship 101: Discovering Your Passion and Path to Change the World ": "This four-module experiential course by +Acumen is a hands-on introduction to social entrepreneurship. It will feature firsth...",
 "  History and Future of (Mostly) Higher Education ": "In this course we will learn about the features of higher education that were designed specifically to prepare workers and leaders for the Industrial Age, and we...",
 "  American Health Policy: The Structure of the American Health Care System (Part I of II)... ": "This course will explain the structure of the American health care system and explore the many problems of this complicated sy...",
 "  Introduction to Computer Science I ": "Introductory course that provides the basic concepts, nomenclature, and historical perspective of computers and computing. Includes an introduction to software d...",
 "  Preparing for CLEP Chemistry: Part 1 ": "The course topics include modern atomic theory, periodic table and trends, stoichiometry, bonding, molecular structure, kinetics, thermodynamics, equilibrium, ac...",
 "  Media and Society ": "Do you know what you’re watching? What you’re reading? You might think that what comes across your television or web browser, in your newspaper or magazine, or o...",
 "  Framing: Creating powerful political messages ": "Is a good, solid argument enough to make an impact? How would you disprove the stance that man-made global warming is just an ...",
 "  The Chemistry of Life ": "Learn how to generate ideas at the interface between chemistry and biology.",
 "  Sampling Theory ": "The course will start with the fundamentals steps involved in the development of any sample survey. The advantages over the complete enumeration will also be dis...",
 "  Psychological First Aid ": "Learn to provide psychological first aid to people in an emergency by employing the RAPID model: Reflective listening, Assessm...",
 "  Les principes de la finance ": "La finance est omniprésente et les décisions financières nous concernent tous. Tout individu est un jour ou l’autre amené à épargner ou emprunter. La sélection d...",
 "  Introduction to Statistics: Descriptive Statistics ": "An introduction to descriptive statistics, emphasizing critical thinking and clear communication.",
 "  Evolution: A Course for Educators ": "How are all of the species living on Earth today related? How does understanding evolutionary science contribute to our well-b...",
 "  Botany ": "Detailed survey of the biology of plant life. Examines what makes plants unique among other kingdoms, then investigates their anatomy and physiology, environment...",
 "  AP® Psychology - Course 2: How the Brain Works ": "This psychology course will show you how the brain works. You will learn the basics of neuroscience, genetics and evolutionary...",
 "  Business and its Environment: An Overview of Business and the Role of Finance in Busine... ": "Introduction to the ways that business is related to, and interacts with, individuals, groups and institutions in the current U.S. environment. This course provi...",
 "  Introduction to Microelectronic Fabrication Processes ": "This is intended to be an introductory course for semiconductor chip fabrication processes. The target audience is undergraduate chemical engineering and electro...",
 "  Introduction to Cultural and Literary Studies ": "Introductory survey of the history and practice of English literary and cultural expression, exploring the major genres of poe...",
 "  Power Onboarding ": "In an engaging six-session format, Power Onboarding will provide practical, easy-to-use tools to guide an individual who is transitioning to a new job. Students ...",
 "  Introductory Human Physiology ": "In this course, students learn to recognize and to apply the basic concepts that govern integrated body function (as an intact...",
 "  Introduction to Statistics ": "Examination of the properties behind the basic concepts of probability and statistics, designed to teach you ways to investigate the relationships between variou...",
 "  Fundamentals of Transport Processes ": "The objective of this course it to provide a fundamental understanding of the convection and diffusion process in fluids, and how these determine the rates of tr...",
 "  Preparing for CLEP Chemistry: Part 2 ": "The course topics include modern atomic theory, periodic table and trends, stoichiometry, bonding, molecular structure, kinetics, thermodynamics, equilibrium, ac...",
 "  Ocean Solutions ": "This course will look at how intelligent and innovative use of the ocean can sustainably deliver the key resources necessary t...",
 "  Innovation and Commercialization ": "Covers from human process of innovating to innovation ecosystems.",
 "  Fundamentals of Clinical Trials ": "Clinical trials play a pivotal role in evidence-based medicine. This course will discuss the design, conduct, analysis, and interpretation of Phase I-IV clinica...",
 "  Science from Superheroes to Global Warming ": "Explore how science works and what constitutes \"good\" science through case studies drawn from a wide spectrum of people's experience, for example superheros, mov...",
 "  Good Brain, Bad Brain: Parkinson's Disease ": "Learn the fundamentals of Parkinson's disease with this free online course. What causes it and what we can do to treat it?",
 "  Confronting The Big Questions: Highlights of Modern Astronomy ": "An introduction to the most modern astronomy's most important questions. The four sections of the course are Planets and Life ...",
 "  Computational Molecular Evolution ": "In this course you will learn about how and why DNA and protein sequences evolve. You will learn the theory behind methods for...",
 "  How to Start a Startup ": "How to start a startup is a class we’re teaching at Stanford. It’s designed to be a sort of one-class business course for peop...",
 "  Aquatic Biodiversity and Environmental Pollution ": "This course is focused on how biodiversity represents the very foundation of human existence in India.This course also focused...",
 "  Managing Your Time, Money, and Career: MBA Insights for Undergraduates ": "This course provides an introduction to the concepts of time and money management along with career and life planning. This co...",
 "  Intro Algebra Review ": "A brief review of introductory algebra topics including integer operations, scientific notation, algebraic expressions, linear equations, and graphing.",
 "Big Data and Social Physics ": "Understanding big data, how to use it to improve companies, cities, and government, and best-practice for privacy",
 "  Analytical Chemistry ": "If chemistry is the science of stuff, then analytical chemistry answers the question: what is it? And how much of it do you have? This advanced chemistry course ...",
 "  Understanding Wireless: Technology, Economics, and Policy ": "Interested in learning how mobile smartphones and tablets convert digital information to and from electromagnetic signals in t...",
 "  International Human Rights ": "International human rights law in comparative perspective: how the individual has been protected from both public and private ...",
 "  Problem Solving and Critical Thinking Skills ": "What do you do when you encounter a problem? This self-paced career development course will help you think critically and creatively to solve problems and design...",
 "  Marine Megafauna: An Introduction to Marine Science and Conservation ": "No longer available. An introduction to the basics of marine science and conservation, brought to you with the help of sea turtles, marine mammals, seabirds ...",
 "  Managerial Accounting ": "Examination of the effects of cost, price and profit on management decision-making, with particular attention to the tools and methods managers use to make the b...",
 "  Poetry in America: The Poetry of Early New England ": "American poetry in cultural context through the year 1700. We begin with Puritan poets--some orthodox, some rebel spirits--wh...",
 "  Econometrics ": "Detailed introduction to the major concepts of econometric analysis, including the classical linear regression model, hypothesis testing, multiple regression ana...",
 "  User Innovation: A Path to Entrepreneurship ": "We’ll let you in on a secret. Innovation isn’t confined inside the walls of research labs swarming with PhDs. More often than not, innovation is about ordinary p...",
 "  How to Succeed in College ": "Learn about college life and develop strategies to help you be successful during your undergraduate experience.",
 "  Becoming a Resilient Person - The Science of Stress Management ": "Everyone experiences adversity and stress at some level, whether it’s the pressure to perform in school or work, relationship...",
 "  Calculus I ": "Detailed introduction of functions, graphs, limits, continuity, and derivatives, and the relationship between derivatives and graphs.",
 "  Super-Earths And Life ": "Super-Earths And Life is a course about alien life, how we search for it, and what this teaches us about our place in the univ...",
 "  Cosmology ": "This course covers cosmology – the study of our entire universe. Where did the universe come from? How will it end? What is th...",
 "  Improving your image: dental photography in practice ": "Learn how to achieve consistent and excellent results in all aspects of dental photography.",
 "  On-Ramp to AP* Physics C: Mechanics ": "This short summer course is intended for the high-school students who have taken an introductory-level physics course, acquire...",
 "  Financial Planning ": "Explore a career in financial planning, including working with clients and the financial planning process.",
 "  Career 911: Your Future Job in Medicine and Healthcare ": "This course aims to help high school students, recent graduates, and those considering career transitions explore health care ...",
 "  A Crash Course on Creativity ": "In this course, Tina Seelig reveals a set of tools and conditions that we each control - our Innovation Engine - that allows us to increase our own creativity an...",
 "  Applications in Engineering Mechanics ": "This course addresses the modeling and analysis of static equilibrium problems with an emphasis on real world engineering systems and problem solving.",
 "  Introduction to Biomedical Imaging ": "Discover how biomedical imaging technologies are complementary and what information they provide to health professionals.",
 "  Geodesign: Change Your World ": "What happens when creativity and science come together? The power to design our world is unleashed, providing tools to inform...",
 "  Live!: A History of Art for Artists, Animators and Gamers ": "Explore art history from the artist's perspective. Learn how contemporary artists, animators and gamers work from the art of the past as part of their creative ...",
 "  Risk Management ": "Exploration of how businesses identify, analyze, and manage the impact of project risk while making critical decisions while c...",
 "  Arts of Latin America ": "A chronological and thematic survey of the major themes and developments in the history of Latin American art, covering the pr...",
 "  The Power of Microeconomics: Economic Principles in the Real World ": "In this course, you will learn all of the major principles of microeconomics normally taught in a quarter or semester course to college undergraduates or MBA stu...",
 "  Developing Your Musicianship ": "Learn the basic concepts and approaches needed to understand, create, and perform contemporary music.",
 "  Essentials of Entrepreneurship: Thinking & Action ": "Success in business can be greatly enhanced with an understanding of key entrepreneurial characteristics and solutions. Gain the skills and confidence to evaluat...",
 "  Marine Biology ": "Detailed introduction to the field of Marine Biology, from a survey of the origin of oceans and their movements to details of marine food webs, life cycles, and ...",
 "  Designing Cities ": "The course explores visionary and practical concepts of city design and planning, past and present, and how design can addres...",
 "  Composite Materials Overview for Engineers ": "Introduction of composite materials from engineering design, manufacturing, and repair viewpoints.",
 "  Financing New Ventures ": "This course examines the range of financing options that a life science/healthcare company has at the startup phase of its lif...",
 "  Write Like Mozart: An Introduction to Classical Music Composition ": "This course introduces students to strategies for style writing of common practice European art music. The issues of harmonic progression, voice leading, and te...",
 "  Entrepreneurship and Healthcare in Emerging Economies ": "Explore how entrepreneurship and innovation tackle complex health problems in emerging economies.",
 "  College Algebra and Problem Solving ": "In this college level Algebra course, you will learn to apply algebraic reasoning to solve problems effectively. You’ll develop skills in linear and quadratic fu...",
 "  Design Decisions in Engineering ": "Detailed introduction to design, product, and process decisions, focusing on safety and ethics, economic and quality decisions, lifecycles, statistics and sensit...",
 "  Rethinking Ageing: Are we prepared to live longer? ": "Population ageing is occurring in nearly every country around the word. This MOOC takes a multidisciplinary approach to explor...",
 "  The Genomics Era: the Future of Genetics in Medicine ": "Learn about the growing role of genomics in healthcare, for patient diagnoses and treatment, with this free online course",
 "  Energy-The Technology You Must Know in the 21st Century | 能源─21世紀你必須了解的科技! ": "Energy technology is a highly multidisciplinary subject, which extends from engineering (e.g. mechanical, chemical, civil, environmental and electrical) to econo...",
 "  Advanced Clinical Proteomics ": "Genomics to Proteomics, Basics of Amino acids and Proteins, Proteins to Proteomics, Sample Preparation for Proteomic Analysis. Gel based Proteomics, Difference I...",
 "  Introduction to Public Speaking ": "A report from the National Association of Colleges and Employers shows that employers want job candidates with strong communication skills. Similarly, educationa...",
 "  Growing Old Around the Globe ": "The world is ageing-people are older and societies are facing hard realities. What are we to make our lives in this time of g...",
 "  Engineering Self-Reflection for Human Completion ": "Through self-reflection, you learn the principle and methodology to find the causes that prevent you from living freely. When ...",
 "  Financial Literacy ": "Develop your knowledge of personal finance, such as how to control, invest and protect your finances.",
 "  Improving Global Health: Focusing on Quality and Safety ": "Access to healthcare services is critical – but is it enough?",
 "  American Health Policy: The Affordable Care Act and the Future of Health Care Reform (P... ": "This course will explore the Affordable Care Act in depth and then turn towards future health reform efforts and the future of...",
 "What’s Your Big Idea? ": "Whether your interest lies in solving the world’s biggest problems, creating the next commercial success or addressing somethi...",
 "  Astronomy: Discovering the Universe ": "Explore the evolution of the universe, the future of astronomy & the role technology plays in new discoveries.",
 "  The Science and Politics of the GMO ": "What exactly are genetically modified organisms (GMOs) and why do scientists develop them? Studying the science of GMOs helps ...",
 "  Corporate Communication ": "Investigation of effective communication skills as a prerequisite for succeeding in business, with particular attention to communication tools and activities tha...",
 "  Sustainability, society and you ": "Join us to explore the major global issue of sustainability and discover how you can have a real impact on our future.",
 "  Library Advocacy Unshushed: Values, evidence, action ": "How can we strengthen libraries and librarians in the advancement of knowledge, creativity, and literacy in the 21st century? Though libraries have been loved fo...",
 "  Exploring Anatomy: the Human Abdomen ": "Explore the anatomy of the human abdomen and understand its clinical importance.",
 "  Human Trafficking ": "Did you know that human trafficking is a form of modern day slavery? Slavery has been around since the beginning of civilizat...",
 "  High-Impact Business Writing ": "Learn how to articulate your thoughts in a clear and concise manner that will allow your ideas to be better understood by your readers. Improve your business wri...",
 "  Algorithms for DNA Sequencing ": "We will learn computational methods -- algorithms and data structures -- for analyzing DNA sequencing data. We will learn a li...",
 "  Preparing for the AP* Physics 2 Exam – Part 3: Optics and Modern Physics ": "Preparing for the AP Physics 2 exam requires a deep understanding of many different topics in physics as well as an understand...",
 "  Introduction to Engineering Mechanics ": "This course is an introduction to learning and applying the principles required to solve engineering mechanics problems.",
 "  AP® Psychology - Course 3: How the Mind Works ": "In this psychology course, you will learn about the mind and the psychology of learning, including coverage of classical condi...",
 "  Sustainable Product Development ": "Environmental sustainability has emerged as the imperative management undertaking for business sustainability in the face of r...",
 "  Dynamics ": "Intro course on the dynamics of mechanical systems: geometry of motion, forces causing motion, and predicting dynamic behavior with computational methods.",
 "  Intro to Descriptive Statistics ": "Intro to Descriptive Statistics will teach you the basic concepts of statistics that can be used to extract information from data.",
 "  Introduction to Business ": "This course is designed as a survey course that will expose you to business terminology, concepts, and current business issues, with the intent of helping studen...",
 "  Health Informatics in the Cloud ": "A non-technical introduction to the contemporary application of computing to healthcare delivery, public health and community-...",
 "  Basics of Energy Sustainability ": "Sustainability, defined by Rice’s Energy and Environment Institute (EEi), is energy security, affordability, and environmental...",
 "  Introduction to Helicopter Aerodynamics and Dynamics ": "Introduction to Hovering Theory, Vertical Flight, Forward Flight, Helicopter Trim and Stability.",
 "  Diagnosing the Financial Health of a Business ": "Learn to assess the strength of a business and identify early warning signs of potential future problems.",
 "  Assessment and Teaching of 21st Century Skills ": "Learn about ways to assess and teach new and emerging 21st century skills: we cover the nature of these skills, alternative methods of assessment, interpretation...",
 "  Design Thinking - 2nd iteration ": "Now with exam and graded certificate! Design Thinking - a multi-stage innovation process that focuses on human needs. Understand theoretical foundations and prac...",
 "  The Enterprise Shed: Making Ideas Happen ": "Everyone is a thinker and a doer. Everyone is entrepreneurial. Turn your ideas into action with this free online course.",
 "  Going Out on a Limb: The Anatomy of the Upper Limb ": "This course explores musculoskeletal anatomy of the Upper Limb, and common injuries that affect its function. We discuss parts...",
 "  Effective Problem-Solving and Decision-Making ": "Gain confidence in assessing problems accurately, evaluating alternative solutions, and anticipating likely risks. Learn how to use analysis, synthesis, and posi...",
 "  Foundations of Psychology ": "One of the reasons we want to understand human nature is so we can help people with psychological disorders. This course lays a foundation for understandings and...",
 "  Human Health and Global Environmental Change ": "This course explores global environmental changes, examining their causes as well as their health consequences, and engages st...",
 "  The Biology of Water and Health - Part 1 ": "This course examines increasingly critical water-related issues through a distinctly global and interdisciplinary lens. Participants will explore the multi-facet...",
 "Giving 2.0: The MOOC ": "A philanthropist is anyone who gives anything time, money, experience, skills, and networks in any amount, to create a better...",
 "  Information and Communication Technology (ICT) Accessibility ": "In this introductory course, learn how to measure an organization’s ICT accessibility and assess the importance of maintaining an inclusive workplace for both em...",
 "  Air Safety Investigation ": "In this course we will explore the challenges faced by investigators when trying to piece together the probable sequence of events. We will familiarize you with ...",
 "  Preparing for the AP* Computer Science A Exam — Level Up! Part 2 ": "Level Up! covers the complete Advanced Placement* Computer Science A course in unique and engaging ways. It's a significant ch...",
 "  Understanding the Brain: The Neurobiology of Everyday Life ": "Learn how the nervous system produces behavior, how we use our brain every day, and how neuroscience can explain the common pr...",
 "  Preparing for the AP Physics 1 Exam ": "This course is designed for high school students preparing to take the AP* Physics 1 Exam. * AP Physics 1 is a registered trademark of the College Board, which w...",
 "  Introduction to Computer Science and Programming ": "This is an introduction to using computation to solve real problems. The course is aimed at students with little or no prior p...",
 "  Greatest Unsolved Mysteries of the Universe ": "Despite spectacular recent progress, there is still a lot we don't know about our universe. We don't know why the Big Bang happened. We don't know what most of t...",
 "  Molecular Biology – Transcription and Transposition ": "Strengthen your scientific thinking and experimental design skills in this adventure through transcription and transposition.",
 "  Molecular Biology ": "Detailed exploration of the structure and function of DNA and RNA and how these nucleic acids are used to form proteins and th...",
 "  Cracking Mechanics: Further Maths for Engineers ": "The aim of this free online course is to introduce you to some of the physics and maths that engineers find useful. The content comprises: parts of A-level maths...",
 "  Spirituality and Sensuality: Sacred Objects in Religious Life ": "Playing drums, telling stories, touching stones, creating wildly colorful altars, dancing, eating and drinking special substan...",
 "  Introduction à la Programmation Objet (in French) ": "Ce cours introduit la programmation orientée objet en utilisant le langage Java. Le cours donne également une introduction aux notions de base de l'algorithmique...",
 "  Generation Rx: The Science Behind Prescription Drug Abuse ": "Think that a prescription medication must be safer than a “street drug”? Think again. Investigate the epidemic rise of prescription drug abuse and use science to...",
 "Introduction to Astronomy ": "An introduction to astronomy through a broad survey of what we know about the universe and how we know it.",
 "  An Introduction to Marketing ": "This Wharton course will teach the fundamentals of marketing by getting to the root of customer decision making. The course will focus on branding strategies, cu...",
 "  From Point of View to Prototype ": "When developing designs, it is important to pick a point of view and consider multiple design options using prototypes. This c...",
 "  Principles of Microeconomics ": "This course is a rigorous introduction to the microeconomic theory of markets: why we have them, how they work, what they accomplish. We will explore what outcom...",
 "  Design Research: Needfinding & Feedback ": "What problem should you be working on? Finding a big problem to solve can help you find opportunities to make a big impact thr...",
 "  English for Doing Business in Asia - Writing ": "The use of English for doing business in multinational settings is a fact of life for many business people. And, as Asian econ...",
 "  Practical tips to improve Asian American participation in cancer clinical trials ": "Racial and ethnic diversity is critical to the success of cancer clinical trials. Asian Americans, like other ethnic groups, have low recruitment, accrual and re...",
 "  Introduction to German Opera ": "Want to listen to an opera for the first time? Have you been listening to opera for your entire life? This course is suited fo...",
 "  Analyzing the Universe ": "Using publicly available data from NASA of actual satellite observations of Astrnomical x-ray sources, we explore some of the mysteries of the cosmos, including...",
 "  Introduction to Computational Arts: Audio ": "In this 6-week course we'll introduce the fundamentals of digital audio. The course will provide the essentials of recording a...",
 "  Becoming an Entrepreneur ": "Learn the business skills and startup mindset needed to embark on your entrepreneurial path from MIT’s entrepreneurship program, MIT Launch.",
 "  Health Literacy and Communication for Health Professionals ": "In the United States, two-thirds of the population read at an eight-grade level or below. When it comes to health information, most Americans have the ability to...",
 "  Fundamentals of Immunology, Part 1 ": "Learn about your body's defenses against disease: how it can identify threats and coordinate counterattacks.",
 "  Shakespeare in Community ": "Shakespeare in Community will introduce a broad audience of learners to Shakespeare, as we collectively read, watch, and engage four plays: Romeo and Juliet, A M...",
 "  Introduction to Functional Programming ": "The aim of this course is to teach the foundations of functional programming and how to apply them in the real world.",
 "  Nutrition, Health, and Lifestyle: Issues and Insights ": "This seven week course will explore nutrition concepts that take center stage in mainstream media outlets and become conversat...",
 "  Journalism Skills for Engaged Citizens ": "This is a course in basic journalism skills designed for citizens who are using new media to publish news, views and informati...",
 "  Preparing for the AP* Computer Science A Exam — Level Up! Part 1 ": "Level Up! covers the complete Advanced Placement* Computer Science A course in unique and engaging ways. It's a significant ch...",
 "  Take Your Medicine - The Impact of Drug Development ": "Discover the impact of drug development and become an informed consumer or scientist.",
 "  Mobile Computing with App Inventor – CS Principles ": "Learn to use the open development tool, App Inventor, to program on Android devices. You will learn how to design and build mo...",
 "  Introduction to Power Electronics ": "The course is an introduction to switched-mode power converters. It provides a basic knowledge of circuitry for the control and conversion of electrical power wi...",
 "  Pay Attention!! ADHD Through the Lifespan ": "This course reviews current scientific knowledge and clinical approaches to Attention-Deficit/Hyperactivity Disorder (ADHD) and examines its impact on developmen...",
 "  Poetry in America: Nature and Nation, 1700-1850 ": "This course, the second installment of the multi-part Poetry in America series, spans the poetry of America’s early years, dir...",
 "Where Next? ": "Generic course for Preparation for First Year Undergraduate Bachelor.",
 "  The Science of Happiness ": "The first MOOC to teach positive psychology. Learn science-based principles and practices for a happy, meaningful life.",
 "  Fundamentals of Immunology, Part 2 ": "Learn about your body's defenses against disease: how it can identify threats and coordinate counterattacks.",
 "  Introduction to Western Art History: Prehistoric to High Gothic ": "Introductory survey of the key works and major movements in Western art and architecture from prehistory to the end of the Medieval period.",
 "  Art & Activity: Interactive Strategies for Engaging with Art ": "Art can be a powerful catalyst for building skills and understanding across a wide range of subjects. Intended for primary and secondary teachers from all discip...",
 "  Sustainable Food Production Through Livestock Health Management ": "Learn about the impact of infectious disease on sustainable animal-based food production by understanding the science of growt...",
 "  Introduction to Mass Media ": "The purpose of this course, as governed by the textbook at its core, Understanding Media and Culture: An Introduction to Mass Communication, is to complete a fai...",
 "  Think Again: How to Reason and Argue ": "Reasoning is important. This course will teach you how to do it well. You will learn how to understand and assess arguments by other people and how to construct ...",
 "  Introduction to Biology: DNA to Organisms ": "Through this class you should be able to explain basic concepts in cellular and molecular biology using correct terminology, a...",
 "  Questionnaire Design for Social Surveys ": "This course will cover the basic elements of designing and evaluating questionnaires. We will review the process of responding...",
 "  The Bible's Prehistory, Purpose, and Political Future ": "How and why was the Bible written? This course synthesizes fascinating recent research in biblical studies and presents a powe...",
 "  Making Sense Of Social Impact: Acumen's Building Blocks For Impact Analysis ": "This five-module introductory course by +Acumen shares how Acumen analyzes social impact of their portfolio companies and that...",
 "  Health and Society ": "The purpose of this course is to introduce students to the major social variables that affect population health.",
 "  Inclusive Leadership Training: Leading with Effective Communication ": "What does it take to inspire others, promote a novel idea, or even have a difficult conversation? How do you know that the message you are intending to send is w...",
 "Succeed with Maths ": "Mathematics course for Preparation for First Year Undergraduate Bachelor.",
 "  Introduction to Astronomy ": "In ASTR101, you will be introduced to our current understanding of the universe and how we have come to this understanding. We will start with the ancient Greek...",
 "  Confronting Gender Based Violence: Global Lessons with Case Studies from India ": "This course introduces participants from the health care sector to gender based violence (GBV), including global epidemiology of GBV, health outcomes, seminal re...",
 "  Supply Chain Management: A Learning Perspective ": "Learn about how to create maximum value through effective supply chain management, in particular, from a dynamic learning pers...",
 "  Introduction to Linux ": "Develop a good working knowledge of Linux using both the graphical interface and command line, covering the major Linux distri...",
 "Introduction to American Politics ": "Introductory course on American politics, with an emphasis on its constitutional foundations, the electoral process and political participation, the decision-mak...",
 "  Aboriginal Worldviews and Education ": "This course will explore indigenous ways of knowing and how this knowledge can inform education to the benefit of all students...",
 "  Introduction to European Business Law ": "The European Union is one of the world's largest and most important economies. Those interested in doing business with the EU ...",
 "  Signals and Systems, Part 1 ": "We encounter signals and systems extensively in our day-to-day lives, from making a phone call, listening to a song, editing photos, manipulating audio files, us...",
 "  Everyday Economics ": "What role does economics play in your day-to-day life? You might be surprised to find that economics is a big part of nearly everything you do! Everyday Economic...",
 "  U.Lab: Transforming Business, Society, and Self ": "Learn how to create profound innovation in a time of disruptive change by leading from the emerging future.",
 "  Statistics and R for the Life Sciences ": "We will learn the basics of statistical inference in order to understand and compute p-values and confidence intervals. We wil...",
 "  Preparing for the AP* Environmental Science Exam - Part 2: Populations ": "Preparing for the AP Environmental Science exam requires a deep understanding of many different topics in environmental scienc...",
 "  Preparing for the AP* Computer Science A Exam — Level Up! Part 4 ": "Level Up! covers the complete Advanced Placement* Computer Science A course in unique and engaging ways. It's a significant ch...",
 "  Intro to Salesforce App Development ": "In this short class you'll build powerful apps without writing code. Great if you're an aspiring developer or someone who want...",
 "  Nutrition and Wellbeing ": "Demystify the complex and conflicting messages we hear about diet, health and lifestyle today, with this free online course.",
 "On-Ramp to AP* French Language and Culture ": "Students who enroll in the French Language and Culture AP class must be ready to engage right from the beginning of the year i...",
 "  Public Finance ": "Examination of the effects of different types of tax and subsidy policies, and of government failure. Analyzes the effects of ...",
 "  Buddhist Meditation and the Modern World ": "Introduces students to (i) the history of Buddhist contemplative traditions in India and Tibet (meditation, yoga, mindfulness,...",
 "  Introduction to Psychology as a Science ": "Learn about how Psychology has developed a body of knowledge about behavior and mind through the use of scientific methods. All areas of Psychology will be cove...",
 "  General Chemistry II ": "Development of the chemical principles and theories for use in a variety of practical applications. Topics include: chemical kinetics, solution chemistry, chemic...",
 "  Lean Startup Principles for Social Impact ": "This course covers a process for taking a social impact idea and assessing its potential for creating long-lasting impact and ...",
 "  Preparing for the AP* Computer Science A Exam — Level Up! Part 3 ": "Level Up! covers the complete Advanced Placement* Computer Science A course in unique and engaging ways. It's a significant ch...",
 "  Heart Health: a Beginner's Guide to Cardiovascular Disease ": "Learn more about how your heart works, the causes of heart disease and how to keep your heart healthy with this free online co...",
 "  Understanding economic policymaking ": "This course will take a non-technical approach to understanding how governments influence the macroeconomy. Topics will inclu...",
 "  Introduction to Chemistry: Structures and Solutions ": "This is an introductory course for students with limited background in chemistry; basic concepts such as atomic and molecular structure, solutions, phases of mat...",
 "  Hypersonics - from Shock Waves to Scramjets ": "Understand flight at speeds greater than Mach 5 and discover how to analyse the performance of a scramjet.",
 "  Introduction to Accounting - Part 1: Basics of Financial Statements ": "This accounting course will give you an overview of business organizations and describes the role accounting plays in managing them. You’ll learn about the effec...",
 "  Environmental Degradation of Materials ": "The course will begin with emphasis on the importance of studying environmental degradation of materials. Fundamentals of environmental degradation of materials...",
 "  Giving With Purpose: How to get the most out of your charitable giving ": "Learn how to identify effective nonprofit organizations and apply course concepts by awarding grants to student-nominated nonp...",
 "  Human Rights: The Rights of Refugees ": "Across the world, barriers are growing. Every day people fleeing war and persecution find the door slammed in their face. Refu...",
 "  Theatre and Globalization ": "Learn how theatre and globalization have affected each other over the past century, and how to conduct your own research on gl...",
 "  Signals and Systems, Part 2 ": "We encounter signals and systems extensively in our day-to-day lives, from making a phone call, listening to a song, editing photos, manipulating audio files, us...",
 "  Essential Human Biology: Cells and Tissues ": "Are you preparing for a health-related career, or planning to study in the health sciences? Perhaps you're just keen to learn ...",
 "  Calculus 1B: Integration ": "How long should the handle of your spoon be so that your fingers do not burn while mixing chocolate fondue? Can you find a sha...",
 "  Advanced Metallurgical Thermodynamics ": "First, second and third laws of thermodynamics, Maxwell's relations, Clausius-Clayperon equation. Solutions: solution models, regular, sub-regular, cluster varia...",
 "  Career Edge: Communication and Teamwork ": "This career development course will teach you how to effectively communicate, collaborate, and resolve conflicts with colleagues and become a stellar team member...",
 "  Neuroethics ": "This course will examine the ethical, legal and social issues raised by neuroscience. Topics will include the implications of ...",
 "  Democratic Development ": "Gain an understanding of the political, social, cultural, economic, institutional and international factors that foster and obstruct the development and consolid...",
 "  Economic Democracy: The Cooperative Alternative ": "Most Western societies are proud of being political democracies, but democracy rarely operates within the firm. Democratic gov...",
 "  Revolutionary Ideas: An Introduction to Legal and Political Philosophy ": "Political and legal institutions are built on foundational, philosophical ideas--ideas about freedom, equality, justice, and happiness. In this course, we will ...",
 "  Fundamentals of Management ": "Now you can acquire an in-depth understanding of the basic concepts and theories of management while exploring the manager's operational role in all types of org...",
 "  Special Topics in Atomic Physics ": "The course will begin with the identification of a complete set of compatible observables for the non-relativistic Hydrogen atom, identify the complete set of 'g...",
 "AP® Macroeconomics: Challenging Concepts ": "Learn the most difficult concepts in the AP® Macroeconomics course, roughly 60% of the AP exam material, from top AP instructo...",
 "  Flight dynamics I - Airplane performance ": "Definition and importance of flight dynamics; forces acting on an airplane; degrees of freedom for a rigid airplane; subdivisions of flight dynamics;",
 "  Ethical Leadership: Character, Civility, and Community ": "Ethical leadership is the critical appropriation and embodiment of traditions that have shaped the character and shared meanin...",
 "  Statistics: Making Sense of Data ": "This course is an introduction to the key ideas and principlesof the collection, display, and analysis of data to guide you in making valid and appropriate concl...",
 "Equine Nutrition ": "This course will cover many aspects of equine nutrition ranging from anatomy and physiology of the gastrointestinal tract to dietary management of horses/ponies ...",
 "  The Study of Folklore ": "This course will concentrate on some of the basic categories of folklore such as myths, folktales, folk festivals, ballads and...",
 "  Preparation for General Chemistry ": "The course develops critical thinking and analytic problem solving skills within a chemistry context in order to prepare students for success in college-level Ge...",
 "  Objects That Define America ": "Explore the history of America through the view of key historic objects, inventions, and exhibits in the Smithsonian collectio...",
 "  Italian Language and Culture: Advanced ": "Learn how to perfect your skills in Italian (speaking, listening, reading and writing), and by the end of this course you will...",
 "  Intermediate Organic Chemistry - Part 1 ": "Organic chemistry course covering intermediate topics in structure and reactivity with emphasis on electronic structure, pericyclic reactions and heteroaromatics...",
 "  Sensing Planet Earth – Water and Ice ": "Global warming. Rising sea levels. Droughts. Flooding. The melting of the polar ice caps. In this energy and earth science co...",
 "  Introduction to Programming with Java - Part 1: Starting to Program in Java ": "This is an introductory course to learn programming with Java. It is comprised of three 5-week parts.   Part 1 introduces programming on the basis of familiar ...",
 "  Interaction Techniques ": "In this course, you will learn relevant fundamentals of human motor performance, perception, and cognition that inform effecti...",
 "  Chemical Engineering Thermodynamics ": "The present course aims to introduce the principles of Chemical Engineering Thermodynamics and illustrate their application to design of chemical process plants....",
 "  Chemistry: Concept Development and Application Part II ": "This course is the second semester of the two semester sequence, Chemistry Concept Development and Application. This course will cover the topics of a typical s...",
 "  Vital Signs: Understanding What the Body Is Telling Us ": "Heart rate, blood pressure, respiration rate, temperature, pain. What do these vital signs tell you about your body? Learn the...",
 "  Civic Ecology: Reclaiming Broken Places ": "Civic ecology is the study of community-driven environmental stewardship practices, their outcomes for individuals, communitie...",
 "  Public Policy Process ": "Examination of the process behind public policy in various policy areas within contemporary American society, including budget...",
 "  Introduction to Biology - The Secret of Life ": "7.00x is an introductory level biology course hosted by professor Eric Lander, who was one of the leaders of the Human Genome Project. The course content reflect...",
 "  AP® Psychology - Course 5: Health and Behavior ": "This psychology course is all about the relationship between health and behavior. We will examine stress as a concept and lear...",
 "  Measurement & Experimentation Laboratory ": "Detailed introduction to woking in an engineering lab. Topics include: scientific notation and statistics, with particular emphasis on graphical data representat...",
 "  Introduction to Project Management ": "Project management is an essential skill-set for many careers and in many contexts in our lives. Introduction to Project Management is an ideal starting point if...",
 "  Financial Planning for Young Adults ": "This course provides an introduction to basic financial planning topics and is targeted towards young adults. General topics i...",
 "  Paradoxes of War ": "An introduction into the historical, psychological, and sociological analysis of organized conflict.",
 "  AP® Physics 2: Challenging Concepts ": "This course covers 9 challenging topics in AP® Physics 2. Well-respected AP instructors from around the USA will lead you thro...",
 "  The European Union in Global Governance ": "The EU is an economic giant but often perceived as a political dwarf and a military worm. By addressing the greatest challenge...",
 "  Intermediate Organic Chemistry - Part 2 ": "Organic chemistry course covering intermediate topics in structure and reactivity with special applications to the life sciences.",
 "  Contemporary India ": "This course provides a sophisticated and intellectually challenging examination of the complexities of a modern and changing I...",
 "  Bullying 101: Beyond common sense ": "Face-to-face and online bullying are widespread phenomena among youth worldwide. Do you want to understand why some kids bully other kids? Are you curious about ...",
 "  How to be a Peer Assessor ": "Generic course for Preparation for First Year Undergraduate Bachelor",
 "  Basic Mandarin Chinese – Level 2 ": "In the second course of the Mandarin Chinese language series, you will learn extensive vocabulary for describing people and ob...",
 "  How to Use Git and GitHub ": "Learn to use version control, an important tool for any developer. The course will focus on Git, a specific version control system, and GitHub, a collaboration p...",
 "  Turbomachinery Aerodynamics ": "Introduction; Aero-Thermodynamics of flow through an Axial flow Compressor stage; Losses in axial flow compressor stage; Losses and Blade performance estimation...",
 "  Ebola: Symptoms, History and Origins ": "Learn about Ebola, its symptoms, where it came from and what the current outbreak has taught us, with this free online course....",
 "  Disaster Preparedness ": "During this course, students will gain an understanding of the Disaster Cycle, concentrating on the Mitigation Phase. They wil...",
 "  Ethical and Social Challenges of Genomic and Precision Medicine ": "Knowledge linking genomics to health and disease is rapidly expanding. Translation of this knowledge into clinical and public...",
 "  Mobile Healthcare technologies for patients and providers ": "Introduction to Biomedical and Health Informatics (BHI) that covers: 1) Informatics needs driven by Big Data generated from cu...",
 "  AstroTech: The Science and Technology behind Astronomical Discovery ": "How astronomy really works - an overview of the technology that astronomers use to collect and measure light from the universe, and how it is used in practice to...",
 "  Principles of Economics: Microeconomics ": "By joining this course, you’ll be exposed to the economic way of thinking. That is, you’ll understand how to use economics in your life and, ultimately, you’ll s...",
 "  Introduction to Actuarial Science ": "Actuary is rated the best job of 2015 by CareerCast.com because it pays well and offers abundant opportunities for advancement...",
 "  Math in Sports ": "In this course you will learn to use some mathematical tools that can help predict and analyze sporting performances and outco...",
 "  The American Disease: Drugs and Drug Control in the USA ": "This online course introduces the history and practice of drug policy. Students will learn about drug laws and their origins, ...",
 "  Dysphagia: Swallowing Difficulties and Medicines ": "This course will enhance the knowledge of any person involved in the administration of medicines to patients with dysphagia.",
 "  Abortion: Quality Care and Public Health Implications ": "Abortion is a common experience for women around the world; yet, abortion is often excluded from the curricula of health profe...",
 "  Fundamentals of Music Theory ": "This course will introduce students to the theory of music, providing them with the skills needed to read and write Western music notation, as well as to underst...",
 "  Introduction to Household Water Treatment and Safe Storage ": "Learn about the most important water treatment methods at household level, successful implementation strategies and about assessing the impact of Household Water...",
 "  ART of the MOOC: Merging Public Art and Experimental Education ": "Join thousands around the world in this free, six-week online course that is also a work of public art. Designed by artist and...",
 "  Introduction to Venture Capital: How to Get Money for your Startup ": "Introduction to Venture Capital will teach you how to get the money needed to run your startup. You will learn who venture cap...",
 "  I \"Heart\" Stats: Learning to Love Statistics ": "When you meet a new person, it is hard to know what to expect.  You may not be able to read the person or understand what they mean. Even if you want to have a g...",
 "  Geoscience: the Earth and its Resources ": "Are you fascinated by Geosciences and willing to take the challenge of predicting the nature and behavior of the Earth subsurface? This is your course! In a voya...",
 "  Content Strategy for Professionals: Growing Audiences for Your Content ": "Professionals at all levels of an organization will learn the best ways to grow an audience they want and need by smartly impl...",
 "  Introduction to Graphene Science and Technology ": "Graphene is the world’s first 2-dimensional material and is the thinnest, strongest, and most flexible material known to exist. A special form of carbon, graphen...",
 "  Effective Thinking Through Mathematics ": "Learn tools of effective thinking through puzzles and the world of mathematics around you in this fun and fascinating course.",
 "  America Through Foreign Eyes ": "What do foreigners think of the United States? Foreign observers and travelers are rarely indifferent to American culture and ...",
 "  Labor Economics ": "Introduction to the theory, data, and policy issues related to labor markets as well as empirical analysis of labor market out...",
 "  AnatomyX: Musculoskeletal Cases ": "Learn the anatomy basic to understanding common musculoskeletal injuries. Follow hypothetical patients from injury to operatin...",
 "  Introduction to Philosophy ": "This course will introduce you to some of the most important areas of research in contemporary philosophy. Each week a different philosopher will talk you throug...",
 "  Preparing for the AP* Biology Exam – Part 2: Genetics ": "Preparing for the AP Biology exam requires a deep understanding of many different topics in biology as well as an understandin...",
 "  The Biology of Water and Health – Fundamentals ": "This course focuses on Fundamentals of water and its relationship to human health. You will explore the multi-faceted ways in ...",
 "Introduction to Philosophy ": "Introductory study on the fundamental questions and methodologies of philosophical inquiry, including metaphysics, epistemology, political philosophy, ethics and...",
 "  Water Supply and Sanitation Policy in Developing Countries ": "This course will examine current conditions and trends in water and sanitation services in the Global South. Within it we will...",
 "  Unlocking the Immunity to Change: A New Approach to Personal Improvement ": "Apply a new psychological theory about personal change to an improvement goal of your own throughout the entire course.",
 "  Developing Your Research Project ": "Curiosity is one of humanity’s most important characteristics. It has enabled us to make the unknown known, to break barriers ...",
 "  Space Flight Mechanics ": "The space flight mechanics is the first course in graduate and undergraduate courses.The advanced course on space flight mechanics gets specialized in the sub st...",
 "  Climate Literacy: Navigating Climate Conversations ": "Climate Literacy tackles the scientific and socio-political dimensions of climate change. This course introduces the basics of...",
 "  Finance ": "This class introduces the basic concepts of modern finance and their practical application. Learn about financial markets and securities, how to rank investment ...",
 "  A Look at Nuclear Science and Technology ": "This course will focus on the theory, design and operation of commercial nuclear power reactors. The course will also touch on contemporary issues regarding nucl...",
 "  Pregnancy and Childbirth: A Global Perspective ": "This course will discuss the global health implications of pregnancy and childbirth in the developing world, where millions of...",
 "  Philosophy and the Sciences ": "Learn about the historical and philosophical foundations of contemporary science. Explore cutting-edge debates in the philosop...",
 "  Classics of Chinese Humanities: Guided Readings ": "An introductory yet trenchant exploration of select Chinese classic texts that cover the domains of classical literature, hist...",
 "  World of Wine: From Grape to Glass ": "Learn about the principles and practices of how grapes are grown and wine is made. Whether you’re a wine novice or a seasoned ...",
 "  Introduction to Thermodynamics: Transferring Energy from Here to There ": "In this course, you will learn how to characterize the energy state of a system and the mechanisms for transferring energy from one system to another. These are ...",
 "  The discovery of the Higgs boson ": "Should we be excited about the Higgs boson? Find out more about developments at the Large Hadron Collider, particle physics and understanding the universe.",
 "  Responsible Innovation ": "Responsible Innovation – exploring the interface of ethics, society and technological innovations",
 "  Introduction to Key Constitutional Concepts and Supreme Court Cases ": "This course offers an introduction to the U.S. Constitution and landmark Supreme Court cases interpreting it. It explores the ...",
 "  A History of the World since 1300 ": "This course will examine the ways in which the world has grown more integrated yet more divided over the past 700 years.",
 "  Massive Personalized Education in a Complex World ": "This POEM (Personalised MOOC) will discuss how in a complex world it can be possible to conciliate massive education as inherited from the last century with pers...",
 "  Introduction to Aerospace Engineering: Astronautics and Human Spaceflight ": "Spaceflight is exciting, and you don’t have to be a “Rocket Scientist” to share in the excitement! 16.00x makes the basics of spaceflight accessible to everyone....",
 "  Fundamentals of Fluid-Solid Interactions ": "Fluid-Solid Interactions happen when the motion of solids and fluids are coupled. The aim of the course is to give you the basic tools to be able to understan...",
 "Learning How to Learn: Powerful mental tools to help you master tough subjects ": "Whether you are an outstanding or a struggling student, \"Learning How to Learn\" will give you powerful mental tools that will ...",
 "  Diploma in Health Studies ": "ALISON's free online Diploma in Health Studies course will give you a comprehensive understanding and knowledge of important h...",
 "  A System View of Communications: From Signals to Packets (Part 1) ": "This introductory course discusses tradeoffs in designing communication systems like mobile phones, and the engineering tools to handle them",
 "  Ethics of Sports: Do Sports Morally Matter? ": "While sport sometimes is dismissed as frivolous, it not only raises fundamental ethical questions, such as what counts as fair...",
 "  The Challenges of Global Poverty ": "A course for those who are interested in the challenge posed by massive and persistent world poverty.",
 "  Genetics ": "Examination of various topics in genetics, focusing on DNA, genes, and chromosomes. Subjects include: crosses, mitosis and mei...",
 "  A Resilient Future: Science and Technology for Disaster Risk Reduction ": "This course aims to introduce participants to existing and emerging technologies suitable for disaster risk reduction while pr...",
 "  Freedom of Expression in the Age of Globalization ": "Are you interested in understanding freedom of expression and information? Do you want to learn how it is defined under intern...",
 "  Introduction to Solar Systems Astronomy ": "In this introductory 4-credit hour lecture and laboratory course, we will explore the origins, structure, contents, and evolution of our solar system and exosola...",
 "  Intro to HTML and CSS ": "Learn how to convert digital design mockups into static web pages and how to build a responsive portfolio site to showcase your work.",
 "  Neurobiology ": "Detailed survey of the anatomy and physiology of the nervous system, including the central and peripheral nervous system divisions and their neurons and supporti...",
 "  Sustainable Agricultural - Urban Land Management ": "This course will cover the agricultural and urban water quality issues in Florida, their bases, land and nutrient management s...",
 "  Moralities of Everyday Life ": "How can we explain kindness and cruelty? Where does our sense of right and wrong come from? Why do people so often disagree ab...",
 "  Diabetes - a Global Challenge ": "Diabetes is a growing health problem in rich and poor countries alike. With this course you will get updated on cutting-edge diabetes research including Bioogica...",
 "  Introduction to Comparative Politics ": "Survey of the governments and politics of several contemporary societies in the Americas, Europe, Africa, Asia, and the Middle East. Explores political leadershi...",
 "  Circadian clocks: how rhythms structure life ": "This course is geared towards starting undergraduate students. A solid background in biology will be helpful but not absolutel...",
 "  Introduction to Chemistry ": "This is an introductory course for students with limited background in chemistry; chemical problem solving will be emphasized with the goal of preparing students...",
 "  Content Strategy for Professionals: Engaging Audiences for Your Organization ": "This professional Content Strategy MOOC is for people anywhere in an organization who have content development experience and ...",
 "  Wheels of Metals: Urban Mining for a Circular Economy ": "Population and welfare are growing. Providing the world with metals is becoming a major challenge. Only by closing the loop wi...",
 "  Myths and Realities of Personalised Medicine: The Genetic Revolution ": "Learn about the concept of \"personalised medicine\" and the impact that our enhanced understanding of genetics has had on moder...",
 "  Legal Risk Management Strategies for Multinational Enterprises ": "Learn the core legal concepts underlying business compliance – the new paradigm in corporate accountability and risk managemen...",
 "  Modern Art ": "Examination of the various artistic movements that comprise 19th- and 20th-century modern art.",
 "  Tropical Coastal Ecosystems ": "Take the challenge and understand problems and solutions to managing tropical coastal ecosystems.",
 "  Curanderismo: Traditional Medicine ": "This online course will provide information on the history, traditions, rituals, herbs and remedies and video demonstrations of Curanderismo, a folk healing trad...",
 "  Law and the Entrepreneur ": "This course will highlight the critical legal and business issues entrepreneurs face as they build and launch a new venture. ...",
 "  Programming for Everybody (Python) ": "This course aims to teach everyone to learn the basics of programming computers using Python. The course has no pre-requisite...",
 "  Inferential Statistics ": "Learn about inferential statistics, and how they are used and misused in the social and behavioral sciences. Learn how to critically evaluate the use of inferent...",
 "  Forensic Accounting and Fraud Examination ": "Everyday across America, thousands of businesses are victimized by fraud. Who commits these bad acts? Why? And, how? In this...",
 "  Employability Skills ": "What skills should international students develop for career success in Germany? This employability MOOC sets out to make a di...",
 "  Age of Globalization ": "Identify the historical and cultural systems driving globalization and changing societies around the world.",
 "  Modern Japanese Architecture: From Meiji Restoration to Today ": "Examine how architecture reflects Japan’s history, starting with its emergence as a new nation in the 19th century and the bui...",
 "  Mechanics II - Dynamics ": "Introduction to the sub-branch of mechanics, dynamics. Topics include: Newtonian mechanics, particle kinetics and kinematics, coordinate systems, work and energy...",
 "  Intermediate Chinese Grammar | 中级汉语语法 ": "课程介绍视频可以访问这里。 本课程将讲解汉语作为第二语言学习中学习者最容易发生偏误的12个汉语最基本的语法项目，帮助学习者进一步理解、掌握这些语法项目在句法、语义及语用上的特点。 This course explores 12 grammar ...",
 "  Modeling Climate Change ": "Bringing together insights from physics, chemistry, biology, earth and atmospheric sciences -- and even some economics -- this...",
 "  Linear Regression Analysis ": "The course focuses on the topics of linear regression analysis. The emphasis will be more on the development of tools from th...",
 "  Introductory Physics - Part 1: Mechanics and Waves ": "Grasp physics from everyday experience. This course covers the basics of Newtonian mechanics, including oscillations and wave phenomena.",
 "  Communicating Strategically ": "Far too frequently, the people who have the most to say have the hardest time saying it. Many of the best minds in our society, our most talented employees and o...",
 "  College Algebra ": "Gain an in-depth understanding of algebraic principles and learn how to use them to solve problems you may meet in everyday life.",
 "  Visual Perception and the Brain ": "The course will consider how what we see is generated by the visual system, and what visual perception indicates about how the...",
 "  Intro to Programming ": "Learn essential computer science and object-oriented programming concepts in this introductory Java course.",
 "  Introduction to Evolutionary Biology and Ecology Lab ": "Introductory course that provides various activities and exercises to explore evolutionary biology and ecology. Lab topics include: genetics, natural selection, ...",
 "  Introduction to Dental Medicine ": "The mouth is the window into human health. This course provides an overview of dental medicine to engage, educate, excite and...",
 "  Child Nutrition and Cooking ": "Learn the basics of child nutrition and how to make healthy meals for healthy children and families.",
 "Dynamics of Ocean Structures ": "The course will give a brief overview of different types of ocean structures that are deployed in sea for exploiting oil, gas and minerals. ",
 "  World History in the Early Modern and Modern Eras (1600-Present) ": "Introductory course to the political, economic, social, and technological transformations in world history, from the 17th cent...",
 "  Integrated Health Management Strategies for Menopause ": "Menopausal women go through physiological processes. About 50% of women at this time will encounter a variety of discomfort, affecting the quality of work life, ...",
 "  Clinical Supervision with Confidence ": "This course is designed to enhance the supervision skills of clinical and educational supervisors of trainee doctors.",
 "  Birds 101: Introduction to Pet Birds ": "Learn to care for your pet birds, from parrots to finches, by studying nutrition & husbandry, behavioral characteristics, and common veterinary procedures.",
 "  Mobile Health Without Borders ": "This course focuses on cost-effective health care solutions using ever-expanding mobile technologies. The addressed themes are: 1) Global Health Challenges. 2) M...",
 "  Introduction to Philosophy: God, Knowledge and Consciousness ": "This course will focus on big questions. You will learn how to ask them and how to answer them.",
 "  Soren Kierkegaard - Subjectivity, Irony and the Crisis of Modernity ": "In this course we will explore how Kierkegaard deals with the problems associated with relativism, the lack of meaning and the undermining of religious faith tha...",
 "  The Rise of Superheroes and Their Impact On Pop Culture ": "Join the Smithsonian, and comic book industry legend Stan Lee, to explore the history of the comic book and the rise of superh...",
 "  Store Design, Visual Merchandising and Shopper Marketing ": "Have you ever wondered how the retail environment influences your shopping behavior? In this course you will learn the secrets of how marketers can use factors l...",
 "  Changing Weather and Climate in the Great Lakes Region ": "Join us for a 4-week learning expedition exploring the exciting weather of the Great Lakes Region, changes underway, and socie...",
 "  Basic Mandarin Chinese – Level 1 ": "Introductory Mandarin is the first in a series of six courses designed to teach you how to speak Mandarin Chinese. This course...",
 "  Hydrostatics and Stability ": "This is the first course for Naval Architecture students in 'Hydrostatics and Stability'. This course covers the basic principles of stability, starting from the...",
 "  Contemporary Health Informatics ": "A non-technical introduction to the contemporary application of computing to healthcare delivery, public health and community-...",
 "  Statistical Inference ": "Learn how to draw conclusions about populations or scientific truths from data. This is the sixth course in the Johns Hopkins Data Science Course Track.",
 "  Human Evolution: Past and Future ": "Introduction to the science of human origins, the fossil and archaeological record, and genetic ancestry of living and ancient...",
 "  Intermediate Macroeconomics ": "Advanced treatment of the dynamics of the macro-economy, which includes topics related to the determination of aggregate output, the determination of the interes...",
 "  Introduction to Computational Arts: Visual Arts ": "This production class serves as an introduction to, and exploration of digital imagery in the arts. Lectures will cover concepts and presentations of artists wor...",
 "  Nutrition and Physical Activity for Health ": "This course will provide a coherent, understandable look at the evidence on how nutrition and physical activity impact health ...",
 "  Explore Statistics with R ": "Learn statistics in a practical, experimental way, through statistical programming with R, using examples from the health scie...",
 "  Introduction to Sustainability ": "This course introduces the academic discipline of sustainability and explores how today's human societies can endure in the fa...",
 "  Principles of Economics for Scientists ": "Quantitative and model-based introduction to basic ideas in economics, and applications to a wide range of real world problems.",
 "  Lean Data Approaches to Measure Social Impact ": "This three-module experiential course by +Acumen is focused on the lean data mindset. You'll have the chance to build a strea...",
 "  Learn to Program: The Fundamentals ": "Behind every mouse click and touch-screen tap, there is a computer program that makes things happen. This course introduces th...",
 "  Ignorance! ": "Ignorance! provides a comprehensive framework for understanding how people think about unknowns, how they deal with them, and even how certain kinds of ignorance...",
 "  The Meaning of Rome: The Renaissance and Baroque City ": "Learn how the art, architecture, and urban form of Renaissance and Baroque Rome projected the city’s image of itself to its ci...",
 "English Common Law: An Introduction ": "For students or professionals who have an interest in learning about the development and application of the law in a common law jurisdiction.",
 "  Introduction to Managerial Economics ": "A successful manager makes good decisions. To make good decisions, you need to understand the market forces that impact your business and personal life. This is ...",
 "  Guinea Pigs, Heroes & Desperate Patients: The History & Ethics of Human Research ": "Learn about the ethical issues that arise when conducting human subjects research, as well as the history that grounds policie...",
 "  United States History II ": "The second course in the introductory surveys of United States history, which focuses on the period from the 1840s to World Wa...",
 "Public Speaking ": "Examination of the elements and factors which result in an effective speech.",
 "  Soul Beliefs: Causes and Consequences ": "Exploration of the causes and consequences of various beliefs about the soul. Topics such as the self, mind/body dualism, evolution, culture, death anxiety, afte...",
 "  AP® Biology - Part 5: Review and Exam Preparation ": "Preparing for the AP Biology exam requires a deep understanding of many different topics in biology as well as an understandin...",
 "  Human Rights: Global & Local Protection ": "When and why have human rights become effectively central? The course will answer such questions, stressing the multi-level di...",
 "  Marriage and the Movies: A History ": "The topic of marriage in the movies has always provided a fascinating reflection of changing social attitudes, shifting morals and gender roles. We will explore ...",
 "  Introduction to Geometry ": "More than 2000 years ago, long before rockets were launched into orbit or explorers sailed around the globe, a Greek mathematician measured the size of the Earth...",
 "  Numerical Methods for Engineers ": "Review of the numeric methods most useful for engineers, with particular emphasis on numbers and binary systems, numerical differentiation, linear algebra, solvi...",
 "  Galaxies and Cosmology ": "An introduction to the modern extragalactic astronomy and cosmology, the physical universe, big bang, formation and evolution ..."
}